<?xml version="1.0" ?>
<net batch="1" name="pedestrian-and-vehicle-detector-adas-0001" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="3456"/>
				<biases offset="3480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="relu1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3608" size="1152"/>
				<biases offset="4760" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="relu2_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4888" size="8192"/>
				<biases offset="13080" size="256"/>
			</blobs>
		</layer>
		<layer id="7" name="relu2_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv2_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="13336" size="2304"/>
				<biases offset="15640" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="relu2_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv2_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="15896" size="30720"/>
				<biases offset="46616" size="480"/>
			</blobs>
		</layer>
		<layer id="11" name="relu2_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv3_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="47096" size="4320"/>
				<biases offset="51416" size="480"/>
			</blobs>
		</layer>
		<layer id="13" name="relu3_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv3_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<weights offset="51896" size="57600"/>
				<biases offset="109496" size="480"/>
			</blobs>
		</layer>
		<layer id="15" name="relu3_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv3_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="109976" size="4320"/>
				<biases offset="114296" size="480"/>
			</blobs>
		</layer>
		<layer id="17" name="relu3_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv3_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="240" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="114776" size="115200"/>
				<biases offset="229976" size="960"/>
			</blobs>
		</layer>
		<layer id="19" name="relu3_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv4_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="240" kernel="3,3" output="240" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="230936" size="8640"/>
				<biases offset="239576" size="960"/>
			</blobs>
		</layer>
		<layer id="21" name="relu4_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv4_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="232" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="240536" size="222720"/>
				<biases offset="463256" size="928"/>
			</blobs>
		</layer>
		<layer id="23" name="relu4_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv4_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="232" kernel="3,3" output="232" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="464184" size="8352"/>
				<biases offset="472536" size="928"/>
			</blobs>
		</layer>
		<layer id="25" name="relu4_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv4_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="448" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>232</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="473464" size="415744"/>
				<biases offset="889208" size="1792"/>
			</blobs>
		</layer>
		<layer id="27" name="relu4_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv5_1/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="448" kernel="3,3" output="448" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="891000" size="16128"/>
				<biases offset="907128" size="1792"/>
			</blobs>
		</layer>
		<layer id="29" name="relu5_1/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv5_1/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="400" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>448</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="908920" size="716800"/>
				<biases offset="1625720" size="1600"/>
			</blobs>
		</layer>
		<layer id="31" name="relu5_1/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv5_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="400" kernel="3,3" output="400" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1627320" size="14400"/>
				<biases offset="1641720" size="1600"/>
			</blobs>
		</layer>
		<layer id="33" name="relu5_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv5_2/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="392" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>400</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1643320" size="627200"/>
				<biases offset="2270520" size="1568"/>
			</blobs>
		</layer>
		<layer id="35" name="relu5_2/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv5_3/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="392" kernel="3,3" output="392" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2272088" size="14112"/>
				<biases offset="2286200" size="1568"/>
			</blobs>
		</layer>
		<layer id="37" name="relu5_3/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv5_3/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="336" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>392</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2287768" size="526848"/>
				<biases offset="2814616" size="1344"/>
			</blobs>
		</layer>
		<layer id="39" name="relu5_3/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv5_4/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="336" kernel="3,3" output="336" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2815960" size="12096"/>
				<biases offset="2828056" size="1344"/>
			</blobs>
		</layer>
		<layer id="41" name="relu5_4/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv5_4/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="368" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>336</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2829400" size="494592"/>
				<biases offset="3323992" size="1472"/>
			</blobs>
		</layer>
		<layer id="43" name="relu5_4/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv5_5/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="368" kernel="3,3" output="368" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3325464" size="13248"/>
				<biases offset="3338712" size="1472"/>
			</blobs>
		</layer>
		<layer id="45" name="relu5_5/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv5_5/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="264" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>368</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3340184" size="388608"/>
				<biases offset="3728792" size="1056"/>
			</blobs>
		</layer>
		<layer id="47" name="relu5_5/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv4_3_0_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3729848" size="152064"/>
				<biases offset="3881912" size="64"/>
			</blobs>
		</layer>
		<layer id="49" name="conv4_3_0_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv4_3_0_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv4_3_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3881976" size="152064"/>
				<biases offset="4034040" size="64"/>
			</blobs>
		</layer>
		<layer id="52" name="conv4_3_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv4_3_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>42</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv5_6/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="264" kernel="3,3" output="264" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>264</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4034104" size="9504"/>
				<biases offset="4043608" size="1056"/>
			</blobs>
		</layer>
		<layer id="55" name="relu5_6/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv5_6/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="296" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4044664" size="312576"/>
				<biases offset="4357240" size="1184"/>
			</blobs>
		</layer>
		<layer id="57" name="relu5_6/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv6/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="296" kernel="3,3" output="296" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4358424" size="10656"/>
				<biases offset="4369080" size="1184"/>
			</blobs>
		</layer>
		<layer id="59" name="relu6/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv6/sep" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>296</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4370264" size="151552"/>
				<biases offset="4521816" size="512"/>
			</blobs>
		</layer>
		<layer id="61" name="relu6/sep" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="fc7_0_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4522328" size="110592"/>
				<biases offset="4632920" size="96"/>
			</blobs>
		</layer>
		<layer id="63" name="fc7_0_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="fc7_0_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="fc7_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4633016" size="110592"/>
				<biases offset="4743608" size="96"/>
			</blobs>
		</layer>
		<layer id="66" name="fc7_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="fc7_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv6_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4743704" size="45056"/>
				<biases offset="4788760" size="352"/>
			</blobs>
		</layer>
		<layer id="69" name="relu6_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv6_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="88" kernel="3,3" output="88" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>88</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4789112" size="3168"/>
				<biases offset="4792280" size="352"/>
			</blobs>
		</layer>
		<layer id="71" name="relu6_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv6_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4792632" size="39424"/>
				<biases offset="4832056" size="448"/>
			</blobs>
		</layer>
		<layer id="73" name="relu6_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv6_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4832504" size="96768"/>
				<biases offset="4929272" size="96"/>
			</blobs>
		</layer>
		<layer id="75" name="conv6_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv6_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv6_2_mbox_loc_bigpriors" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4929368" size="96768"/>
				<biases offset="5026136" size="96"/>
			</blobs>
		</layer>
		<layer id="78" name="conv6_2_mbox_loc_perm_bigpriors" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv6_2_mbox_loc_flat_bigpriors" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>11</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv7_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5026232" size="50176"/>
				<biases offset="5076408" size="448"/>
			</blobs>
		</layer>
		<layer id="81" name="relu7_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv7_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5076856" size="4032"/>
				<biases offset="5080888" size="448"/>
			</blobs>
		</layer>
		<layer id="83" name="relu7_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv7_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5081336" size="50176"/>
				<biases offset="5131512" size="448"/>
			</blobs>
		</layer>
		<layer id="85" name="relu7_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv7_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5131960" size="96768"/>
				<biases offset="5228728" size="96"/>
			</blobs>
		</layer>
		<layer id="87" name="conv7_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv7_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="conv7_2_mbox_loc_bigpriors" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5228824" size="96768"/>
				<biases offset="5325592" size="96"/>
			</blobs>
		</layer>
		<layer id="90" name="conv7_2_mbox_loc_perm_bigpriors" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="conv7_2_mbox_loc_flat_bigpriors" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv8_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5325688" size="53760"/>
				<biases offset="5379448" size="480"/>
			</blobs>
		</layer>
		<layer id="93" name="relu8_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv8_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5379928" size="4320"/>
				<biases offset="5384248" size="480"/>
			</blobs>
		</layer>
		<layer id="95" name="relu8_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv8_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="208" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5384728" size="99840"/>
				<biases offset="5484568" size="832"/>
			</blobs>
		</layer>
		<layer id="97" name="relu8_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv8_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5485400" size="119808"/>
				<biases offset="5605208" size="64"/>
			</blobs>
		</layer>
		<layer id="99" name="conv8_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv8_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="conv9_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5605272" size="53248"/>
				<biases offset="5658520" size="256"/>
			</blobs>
		</layer>
		<layer id="102" name="relu9_1" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="conv9_2/dw" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5658776" size="2304"/>
				<biases offset="5661080" size="256"/>
			</blobs>
		</layer>
		<layer id="104" name="relu9_2/dw" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="conv9_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5661336" size="32768"/>
				<biases offset="5694104" size="512"/>
			</blobs>
		</layer>
		<layer id="106" name="relu9_2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="conv9_2_mbox_loc" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5694616" size="73728"/>
				<biases offset="5768344" size="64"/>
			</blobs>
		</layer>
		<layer id="108" name="conv9_2_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="conv9_2_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="mbox_loc" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16128</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>1584</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>432</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>432</dim>
				</port>
				<port id="8">
					<dim>1</dim>
					<dim>96</dim>
				</port>
				<port id="9">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="10">
					<dim>1</dim>
					<dim>48512</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="conv4_3_0_norm_mbox_conf" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="12" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>12</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5768408" size="114048"/>
