<?xml version="1.0" ?>
<net batch="1" name="ICV-RMNet-PD-ReID-Light" version="6">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data/norm/scale/Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="12"/>
				<biases offset="12" size="12"/>
			</blobs>
		</layer>
		<layer id="2" name="init_block1/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="24" size="3456"/>
				<biases offset="3480" size="128"/>
			</blobs>
		</layer>
		<layer id="3" name="init_block1/dim_inc/fn" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="bottleneck1_1/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3608" size="1024"/>
				<biases offset="4632" size="32"/>
			</blobs>
		</layer>
		<layer id="5" name="bottleneck1_1/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="bottleneck1_1/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4664" size="288"/>
				<biases offset="4952" size="32"/>
			</blobs>
		</layer>
		<layer id="7" name="bottleneck1_1/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="bottleneck1_1/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4984" size="1024"/>
				<biases offset="6008" size="128"/>
			</blobs>
		</layer>
		<layer id="9" name="bottleneck1_1/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="bottleneck1_1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="bottleneck1_2/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6136" size="1024"/>
				<biases offset="7160" size="32"/>
			</blobs>
		</layer>
		<layer id="12" name="bottleneck1_2/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bottleneck1_2/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7192" size="288"/>
				<biases offset="7480" size="32"/>
			</blobs>
		</layer>
		<layer id="14" name="bottleneck1_2/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="bottleneck1_2/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7512" size="1024"/>
				<biases offset="8536" size="128"/>
			</blobs>
		</layer>
		<layer id="16" name="bottleneck1_2/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="bottleneck1_2/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="bottleneck1_3/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8664" size="1024"/>
				<biases offset="9688" size="32"/>
			</blobs>
		</layer>
		<layer id="19" name="bottleneck1_3/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="bottleneck1_3/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9720" size="288"/>
				<biases offset="10008" size="32"/>
			</blobs>
		</layer>
		<layer id="21" name="bottleneck1_3/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="bottleneck1_3/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10040" size="1024"/>
				<biases offset="11064" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="bottleneck1_3/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="bottleneck1_3/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="bottleneck2_0/skip/pooling" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="bottleneck2_0/skip/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="11192" size="8192"/>
				<biases offset="19384" size="256"/>
			</blobs>
		</layer>
		<layer id="27" name="bottleneck2_0/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<weights offset="19640" size="2048"/>
				<biases offset="21688" size="64"/>
			</blobs>
		</layer>
		<layer id="28" name="bottleneck2_0/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="bottleneck2_0/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="21752" size="576"/>
				<biases offset="22328" size="64"/>
			</blobs>
		</layer>
		<layer id="30" name="bottleneck2_0/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="bottleneck2_0/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="22392" size="4096"/>
				<biases offset="26488" size="256"/>
			</blobs>
		</layer>
		<layer id="32" name="bottleneck2_0/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="bottleneck2_0/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="bottleneck2_1/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="26744" size="4096"/>
				<biases offset="30840" size="64"/>
			</blobs>
		</layer>
		<layer id="35" name="bottleneck2_1/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bottleneck2_1/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30904" size="576"/>
				<biases offset="31480" size="64"/>
			</blobs>
		</layer>
		<layer id="37" name="bottleneck2_1/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bottleneck2_1/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="31544" size="4096"/>
				<biases offset="35640" size="256"/>
			</blobs>
		</layer>
		<layer id="39" name="bottleneck2_1/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bottleneck2_1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bottleneck2_2/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="35896" size="4096"/>
				<biases offset="39992" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="bottleneck2_2/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="bottleneck2_2/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40056" size="576"/>
				<biases offset="40632" size="64"/>
			</blobs>
		</layer>
		<layer id="44" name="bottleneck2_2/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bottleneck2_2/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40696" size="4096"/>
				<biases offset="44792" size="256"/>
			</blobs>
		</layer>
		<layer id="46" name="bottleneck2_2/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="bottleneck2_2/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bottleneck2_3/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="45048" size="4096"/>
				<biases offset="49144" size="64"/>
			</blobs>
		</layer>
		<layer id="49" name="bottleneck2_3/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="bottleneck2_3/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="49208" size="576"/>
				<biases offset="49784" size="64"/>
			</blobs>
		</layer>
		<layer id="51" name="bottleneck2_3/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="bottleneck2_3/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="49848" size="4096"/>
				<biases offset="53944" size="256"/>
			</blobs>
		</layer>
		<layer id="53" name="bottleneck2_3/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="bottleneck2_3/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bottleneck3_0/skip/pooling" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="bottleneck3_0/skip/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="54200" size="32768"/>
				<biases offset="86968" size="512"/>
			</blobs>
		</layer>
		<layer id="57" name="bottleneck3_0/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<weights offset="87480" size="8192"/>
				<biases offset="95672" size="128"/>
			</blobs>
		</layer>
		<layer id="58" name="bottleneck3_0/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bottleneck3_0/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="95800" size="1152"/>
				<biases offset="96952" size="128"/>
			</blobs>
		</layer>
		<layer id="60" name="bottleneck3_0/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bottleneck3_0/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="97080" size="16384"/>
				<biases offset="113464" size="512"/>
			</blobs>
		</layer>
		<layer id="62" name="bottleneck3_0/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="bottleneck3_0/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="bottleneck3_1/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="113976" size="16384"/>
				<biases offset="130360" size="128"/>
			</blobs>
		</layer>
		<layer id="65" name="bottleneck3_1/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bottleneck3_1/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="130488" size="1152"/>
				<biases offset="131640" size="128"/>
			</blobs>
		</layer>
		<layer id="67" name="bottleneck3_1/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bottleneck3_1/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="131768" size="16384"/>
				<biases offset="148152" size="512"/>
			</blobs>
		</layer>
		<layer id="69" name="bottleneck3_1/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="bottleneck3_1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck3_2/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="148664" size="16384"/>
				<biases offset="165048" size="128"/>
			</blobs>
		</layer>
		<layer id="72" name="bottleneck3_2/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="bottleneck3_2/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="165176" size="1152"/>
				<biases offset="166328" size="128"/>
			</blobs>
		</layer>
		<layer id="74" name="bottleneck3_2/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="bottleneck3_2/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="166456" size="16384"/>
				<biases offset="182840" size="512"/>
			</blobs>
		</layer>
		<layer id="76" name="bottleneck3_2/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="bottleneck3_2/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bottleneck3_3/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="183352" size="16384"/>
				<biases offset="199736" size="128"/>
			</blobs>
		</layer>
		<layer id="79" name="bottleneck3_3/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bottleneck3_3/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="199864" size="1152"/>
				<biases offset="201016" size="128"/>
			</blobs>
		</layer>
		<layer id="81" name="bottleneck3_3/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bottleneck3_3/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="201144" size="16384"/>
				<biases offset="217528" size="512"/>
			</blobs>
		</layer>
		<layer id="83" name="bottleneck3_3/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="bottleneck3_3/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck4_0/skip/pooling" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bottleneck4_0/skip/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="218040" size="131072"/>
				<biases offset="349112" size="1024"/>
			</blobs>
		</layer>
		<layer id="87" name="bottleneck4_0/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<weights offset="350136" size="32768"/>
				<biases offset="382904" size="256"/>
			</blobs>
		</layer>
		<layer id="88" name="bottleneck4_0/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="bottleneck4_0/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="383160" size="2304"/>
				<biases offset="385464" size="256"/>
			</blobs>
		</layer>
		<layer id="90" name="bottleneck4_0/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bottleneck4_0/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="385720" size="65536"/>
				<biases offset="451256" size="1024"/>
			</blobs>
		</layer>
		<layer id="92" name="bottleneck4_0/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="bottleneck4_0/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="bottleneck4_1/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="452280" size="65536"/>
				<biases offset="517816" size="256"/>
			</blobs>
		</layer>
		<layer id="95" name="bottleneck4_1/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bottleneck4_1/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="518072" size="2304"/>
				<biases offset="520376" size="256"/>
			</blobs>
		</layer>
		<layer id="97" name="bottleneck4_1/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck4_1/dim_inc/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="520632" size="65536"/>
				<biases offset="586168" size="1024"/>
			</blobs>
		</layer>
		<layer id="99" name="bottleneck4_1/add" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="bottleneck4_1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck4_2/dim_red/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="587192" size="65536"/>
				<biases offset="652728" size="256"/>
			</blobs>
		</layer>
		<layer id="102" name="bottleneck4_2/dim_red/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="bottleneck4_2/inner/dw1/conv" precision="FP32" type="Convolution">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<weights offset="652984" size="2304"/>
				<biases offset="655288" size="256"/>
			</blobs>
		</layer>
		<layer id="104" name="bottleneck4_2/inner/dw1/fn" precision="FP32" type="Activation">
			<data alpha="1.0" type="elu"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
