<?xml version="1.0"?>
<net name="face-detection-retail-0005" version="6" batch="1">
	<layers>
		<layer name="input.1" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_" type="Power" precision="FP32" id="1">
			<data power="1.000000" scale="0.003922" shift="0.000000" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul1_6931/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="2">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="332" type="Convolution" precision="FP32" id="3">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="96" />
				<weights offset="120" size="2592" />
			</blobs>
		</layer>
		<layer name="334" type="ReLU" precision="FP32" id="4">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="335" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="24" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2712" size="96" />
				<weights offset="2808" size="864" />
			</blobs>
		</layer>
		<layer name="337" type="ReLU" precision="FP32" id="6">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="338" type="Convolution" precision="FP32" id="7">
			<data dilations="1,1" group="1" kernel="1,1" output="12" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3672" size="48" />
				<weights offset="3720" size="1152" />
			</blobs>
		</layer>
		<layer name="340" type="Convolution" precision="FP32" id="8">
			<data dilations="1,1" group="1" kernel="1,1" output="72" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4872" size="288" />
				<weights offset="5160" size="3456" />
			</blobs>
		</layer>
		<layer name="342" type="ReLU" precision="FP32" id="9">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer name="343" type="Convolution" precision="FP32" id="10">
			<data dilations="1,1" group="72" kernel="3,3" output="72" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8616" size="288" />
				<weights offset="8904" size="2592" />
			</blobs>
		</layer>
		<layer name="345" type="ReLU" precision="FP32" id="11">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="346" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="1" kernel="1,1" output="18" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11496" size="72" />
				<weights offset="11568" size="5184" />
			</blobs>
		</layer>
		<layer name="348" type="Convolution" precision="FP32" id="13">
			<data dilations="1,1" group="1" kernel="1,1" output="108" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="16752" size="432" />
				<weights offset="17184" size="7776" />
			</blobs>
		</layer>
		<layer name="350" type="ReLU" precision="FP32" id="14">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="351" type="Convolution" precision="FP32" id="15">
			<data dilations="1,1" group="108" kernel="3,3" output="108" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24960" size="432" />
				<weights offset="25392" size="3888" />
			</blobs>
		</layer>
		<layer name="353" type="ReLU" precision="FP32" id="16">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="354" type="Convolution" precision="FP32" id="17">
			<data dilations="1,1" group="1" kernel="1,1" output="18" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="29280" size="72" />
				<weights offset="29352" size="7776" />
			</blobs>
		</layer>
		<layer name="356" type="Eltwise" precision="FP32" id="18">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="357" type="Convolution" precision="FP32" id="19">
			<data dilations="1,1" group="1" kernel="1,1" output="108" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>18</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<biases offset="37128" size="432" />
				<weights offset="37560" size="7776" />
			</blobs>
		</layer>
		<layer name="359" type="ReLU" precision="FP32" id="20">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer name="360" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="108" kernel="3,3" output="108" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="45336" size="432" />
				<weights offset="45768" size="3888" />
			</blobs>
		</layer>
		<layer name="362" type="ReLU" precision="FP32" id="22">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="363" type="Convolution" precision="FP32" id="23">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>108</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49656" size="96" />
				<weights offset="49752" size="10368" />
			</blobs>
		</layer>
		<layer name="365" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="60120" size="576" />
				<weights offset="60696" size="13824" />
			</blobs>
		</layer>
		<layer name="367" type="ReLU" precision="FP32" id="25">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="368" type="Convolution" precision="FP32" id="26">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="74520" size="576" />
				<weights offset="75096" size="5184" />
			</blobs>
		</layer>
		<layer name="370" type="ReLU" precision="FP32" id="27">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="371" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="80280" size="96" />
				<weights offset="80376" size="13824" />
			</blobs>
		</layer>
		<layer name="373" type="Eltwise" precision="FP32" id="29">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="374" type="Convolution" precision="FP32" id="30">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="94200" size="576" />
				<weights offset="94776" size="13824" />
			</blobs>
		</layer>
		<layer name="376" type="ReLU" precision="FP32" id="31">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="377" type="Convolution" precision="FP32" id="32">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="108600" size="576" />
				<weights offset="109176" size="5184" />
			</blobs>
		</layer>
		<layer name="379" type="ReLU" precision="FP32" id="33">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="380" type="Convolution" precision="FP32" id="34">
			<data dilations="1,1" group="1" kernel="1,1" output="24" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="114360" size="96" />
				<weights offset="114456" size="13824" />
			</blobs>
		</layer>
		<layer name="382" type="Eltwise" precision="FP32" id="35">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="383" type="Convolution" precision="FP32" id="36">
			<data dilations="1,1" group="1" kernel="1,1" output="144" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
			<blobs>
				<biases offset="128280" size="576" />
				<weights offset="128856" size="13824" />
			</blobs>
		</layer>
		<layer name="385" type="ReLU" precision="FP32" id="37">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer name="386" type="Convolution" precision="FP32" id="38">
			<data dilations="1,1" group="144" kernel="3,3" output="144" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>38</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="142680" size="576" />
				<weights offset="143256" size="5184" />
			</blobs>
		</layer>
		<layer name="388" type="ReLU" precision="FP32" id="39">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="389" type="Convolution" precision="FP32" id="40">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="148440" size="192" />
				<weights offset="148632" size="27648" />
			</blobs>
		</layer>
		<layer name="391" type="Convolution" precision="FP32" id="41">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="176280" size="1152" />
				<weights offset="177432" size="55296" />
			</blobs>
		</layer>
		<layer name="393" type="ReLU" precision="FP32" id="42">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="394" type="Convolution" precision="FP32" id="43">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="232728" size="1152" />
				<weights offset="233880" size="10368" />
			</blobs>
		</layer>
		<layer name="396" type="ReLU" precision="FP32" id="44">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="397" type="Convolution" precision="FP32" id="45">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="244248" size="192" />
				<weights offset="244440" size="55296" />
			</blobs>
		</layer>
		<layer name="399" type="Eltwise" precision="FP32" id="46">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="400" type="Convolution" precision="FP32" id="47">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="299736" size="1152" />
				<weights offset="300888" size="55296" />
			</blobs>
		</layer>
		<layer name="402" type="ReLU" precision="FP32" id="48">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="403" type="Convolution" precision="FP32" id="49">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="356184" size="1152" />
				<weights offset="357336" size="10368" />
			</blobs>
		</layer>
		<layer name="405" type="ReLU" precision="FP32" id="50">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="406" type="Convolution" precision="FP32" id="51">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="367704" size="192" />
				<weights offset="367896" size="55296" />
			</blobs>
		</layer>
		<layer name="408" type="Eltwise" precision="FP32" id="52">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="409" type="Convolution" precision="FP32" id="53">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="423192" size="1152" />
				<weights offset="424344" size="55296" />
			</blobs>
		</layer>
		<layer name="411" type="ReLU" precision="FP32" id="54">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="412" type="Convolution" precision="FP32" id="55">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="479640" size="1152" />
				<weights offset="480792" size="10368" />
			</blobs>
		</layer>
		<layer name="414" type="ReLU" precision="FP32" id="56">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="415" type="Convolution" precision="FP32" id="57">
			<data dilations="1,1" group="1" kernel="1,1" output="48" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="491160" size="192" />
				<weights offset="491352" size="55296" />
			</blobs>
		</layer>
		<layer name="417" type="Eltwise" precision="FP32" id="58">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="418" type="Convolution" precision="FP32" id="59">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="546648" size="1152" />
				<weights offset="547800" size="55296" />
			</blobs>
		</layer>
		<layer name="420" type="ReLU" precision="FP32" id="60">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="421" type="Convolution" precision="FP32" id="61">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="603096" size="1152" />
				<weights offset="604248" size="10368" />
			</blobs>
		</layer>
		<layer name="423" type="ReLU" precision="FP32" id="62">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="424" type="Convolution" precision="FP32" id="63">
			<data dilations="1,1" group="1" kernel="1,1" output="72" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="614616" size="288" />
				<weights offset="614904" size="82944" />
			</blobs>
		</layer>
		<layer name="426" type="Convolution" precision="FP32" id="64">
			<data dilations="1,1" group="1" kernel="1,1" output="432" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="697848" size="1728" />
				<weights offset="699576" size="124416" />
			</blobs>
		</layer>
		<layer name="428" type="ReLU" precision="FP32" id="65">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="429" type="Convolution" precision="FP32" id="66">
			<data dilations="1,1" group="432" kernel="3,3" output="432" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="823992" size="1728" />
				<weights offset="825720" size="15552" />
			</blobs>
		</layer>
		<layer name="431" type="ReLU" precision="FP32" id="67">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="432" type="Convolution" precision="FP32" id="68">
			<data dilations="1,1" group="1" kernel="1,1" output="72" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="841272" size="288" />
				<weights offset="841560" size="124416" />
			</blobs>
		</layer>
		<layer name="434" type="Eltwise" precision="FP32" id="69">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="435" type="Convolution" precision="FP32" id="70">
			<data dilations="1,1" group="1" kernel="1,1" output="432" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="965976" size="1728" />
				<weights offset="967704" size="124416" />
			</blobs>
		</layer>
		<layer name="437" type="ReLU" precision="FP32" id="71">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="438" type="Convolution" precision="FP32" id="72">
			<data dilations="1,1" group="432" kernel="3,3" output="432" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1092120" size="1728" />
				<weights offset="1093848" size="15552" />
			</blobs>
		</layer>
		<layer name="440" type="ReLU" precision="FP32" id="73">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="441" type="Convolution" precision="FP32" id="74">
			<data dilations="1,1" group="1" kernel="1,1" output="72" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1109400" size="288" />
				<weights offset="1109688" size="124416" />
			</blobs>
		</layer>
		<layer name="443" type="Eltwise" precision="FP32" id="75">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="444" type="Convolution" precision="FP32" id="76">
			<data dilations="1,1" group="1" kernel="1,1" output="432" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>72</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1234104" size="1728" />
				<weights offset="1235832" size="124416" />
			</blobs>
		</layer>
		<layer name="446" type="ReLU" precision="FP32" id="77">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="447" type="Convolution" precision="FP32" id="78">
			<data dilations="1,1" group="432" kernel="3,3" output="432" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1360248" size="1728" />
				<weights offset="1361976" size="15552" />
			</blobs>
		</layer>
		<layer name="449" type="ReLU" precision="FP32" id="79">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="450" type="Convolution" precision="FP32" id="80">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>432</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1377528" size="480" />
				<weights offset="1378008" size="207360" />
			</blobs>
		</layer>
		<layer name="452" type="Convolution" precision="FP32" id="81">
			<data dilations="1,1" group="1" kernel="1,1" output="720" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1585368" size="2880" />
				<weights offset="1588248" size="345600" />
			</blobs>
		</layer>
		<layer name="454" type="ReLU" precision="FP32" id="82">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="455" type="Convolution" precision="FP32" id="83">
			<data dilations="1,1" group="720" kernel="3,3" output="720" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1933848" size="2880" />
				<weights offset="1936728" size="25920" />
			</blobs>
		</layer>
		<layer name="457" type="ReLU" precision="FP32" id="84">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="458" type="Convolution" precision="FP32" id="85">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1962648" size="480" />
				<weights offset="1963128" size="345600" />
			</blobs>
		</layer>
		<layer name="460" type="Eltwise" precision="FP32" id="86">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="461" type="Convolution" precision="FP32" id="87">
			<data dilations="1,1" group="1" kernel="1,1" output="720" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2308728" size="2880" />
				<weights offset="2311608" size="345600" />
			</blobs>
		</layer>
		<layer name="463" type="ReLU" precision="FP32" id="88">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="464" type="Convolution" precision="FP32" id="89">
			<data dilations="1,1" group="720" kernel="3,3" output="720" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2657208" size="2880" />
				<weights offset="2660088" size="25920" />
			</blobs>
		</layer>
		<layer name="466" type="ReLU" precision="FP32" id="90">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="467" type="Convolution" precision="FP32" id="91">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>720</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2686008" size="480" />
				<weights offset="2686488" size="345600" />
			</blobs>
		</layer>
		<layer name="469" type="Eltwise" precision="FP32" id="92">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="470" type="Convolution" precision="FP32" id="93">
			<data dilations="1,1" group="1" kernel="1,1" output="480" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3032088" size="1920" />
				<weights offset="3034008" size="230400" />
			</blobs>
		</layer>
		<layer name="472" type="ReLU" precision="FP32" id="94">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="473" type="Convolution" precision="FP32" id="95">
			<data dilations="1,1" group="480" kernel="3,3" output="480" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3264408" size="1920" />
				<weights offset="3266328" size="17280" />
			</blobs>
		</layer>
		<layer name="475" type="ReLU" precision="FP32" id="96">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="476" type="Convolution" precision="FP32" id="97">
			<data dilations="1,1" group="1" kernel="1,1" output="360" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>480</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3283608" size="1440" />
				<weights offset="3285048" size="691200" />
			</blobs>
		</layer>
		<layer name="482" type="Convolution" precision="FP32" id="98">
			<data dilations="1,1" group="360" kernel="3,3" output="360" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3976248" size="1440" />
				<weights offset="3977688" size="12960" />
			</blobs>
		</layer>
		<layer name="484" type="ReLU" precision="FP32" id="99">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="485" type="Convolution" precision="FP32" id="100">
			<data dilations="1,1" group="1" kernel="1,1" output="36" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>36</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3990648" size="144" />
				<weights offset="3990792" size="51840" />
			</blobs>
		</layer>
		<layer name="517" type="Permute" precision="FP32" id="101">
			<data order="0,2,3,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>36</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>19</dim>
					<dim>19</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer name="478" type="Convolution" precision="FP32" id="102">
			<data dilations="1,1" group="360" kernel="3,3" output="360" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4042632" size="1440" />
				<weights offset="4044072" size="12960" />
			</blobs>
		</layer>
		<layer name="480" type="ReLU" precision="FP32" id="103">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
		</layer>
		<layer name="481" type="Convolution" precision="FP32" id="104">
			<data dilations="1,1" group="1" kernel="1,1" output="18" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>360</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>18</dim>
					<dim>19</dim>
					<dim>19</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4057032" size="72" />
				<weights offset="4057104" size="25920" />
			</blobs>
		</layer>
		<layer name="488" type="Permute" precision="FP32" id="105">
