<?xml version="1.0"?>
<net name="head-pose-estimation-adas-0001" version="6" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="conv1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="relu_conv1" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_999/FusedScaleShift_" type="ScaleShift" precision="FP32" id="4">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128" />
				<weights offset="3736" size="128" />
			</blobs>
		</layer>
		<layer name="pool1" type="Convolution" precision="FP32" id="5">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3864" size="64" />
				<weights offset="3928" size="18432" />
			</blobs>
		</layer>
		<layer name="conv2" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22360" size="256" />
				<weights offset="22616" size="36864" />
			</blobs>
		</layer>
		<layer name="relu_conv2" type="ReLU" precision="FP32" id="7">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_990/FusedScaleShift_" type="ScaleShift" precision="FP32" id="8">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59480" size="256" />
				<weights offset="59736" size="256" />
			</blobs>
		</layer>
		<layer name="pool2" type="Pooling" precision="FP32" id="9">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>30</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3" type="Convolution" precision="FP32" id="10">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="59992" size="512" />
				<weights offset="60504" size="294912" />
			</blobs>
		</layer>
		<layer name="relu_conv3" type="ReLU" precision="FP32" id="11">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1011/FusedScaleShift_" type="ScaleShift" precision="FP32" id="12">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</output>
			<blobs>
				<biases offset="355416" size="512" />
				<weights offset="355928" size="512" />
			</blobs>
		</layer>
		<layer name="pool3" type="Convolution" precision="FP32" id="13">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>15</dim>
					<dim>15</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="356440" size="256" />
				<weights offset="356696" size="294912" />
			</blobs>
		</layer>
		<layer name="conv4" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="3,3" output="128" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="651608" size="512" />
				<weights offset="652120" size="294912" />
			</blobs>
		</layer>
		<layer name="relu_conv4" type="ReLU" precision="FP32" id="15">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1014/FusedScaleShift_" type="ScaleShift" precision="FP32" id="16">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</output>
			<blobs>
				<biases offset="947032" size="512" />
				<weights offset="947544" size="512" />
			</blobs>
		</layer>
		<layer name="pool4" type="Pooling" precision="FP32" id="17">
			<data exclude-pad="true" kernel="3,3" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="3,3" output="256" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="948056" size="1024" />
				<weights offset="949080" size="1179648" />
			</blobs>
		</layer>
		<layer name="relu_conv5" type="ReLU" precision="FP32" id="19">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_1005/FusedScaleShift_" type="ScaleShift" precision="FP32" id="20">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2128728" size="1024" />
				<weights offset="2129752" size="1024" />
			</blobs>
		</layer>
		<layer name="conv_fm" type="Convolution" precision="FP32" id="21">
			<data dilations="1,1" group="1" kernel="3,3" output="512" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2130776" size="2048" />
				<weights offset="2132824" size="4718592" />
			</blobs>
		</layer>
		<layer name="angle_y" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6851416" size="512" />
				<weights offset="6851928" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_y_1" type="ReLU" precision="FP32" id="23">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_y_fc" type="FullyConnected" precision="FP32" id="24">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7114072" size="4" />
				<weights offset="7114076" size="2048" />
			</blobs>
		</layer>
		<layer name="angle_r" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7116124" size="512" />
				<weights offset="7116636" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_r_1" type="ReLU" precision="FP32" id="26">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_r_fc" type="FullyConnected" precision="FP32" id="27">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7378780" size="4" />
				<weights offset="7378784" size="2048" />
			</blobs>
		</layer>
		<layer name="angle_p" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7380832" size="512" />
				<weights offset="7381344" size="262144" />
			</blobs>
		</layer>
		<layer name="relu_p_1" type="ReLU" precision="FP32" id="29">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="angle_p_fc" type="FullyConnected" precision="FP32" id="30">
			<data out-size="1" quantization_level="FP32" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7643488" size="4" />
				<weights offset="7643492" size="2048" />
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
		<edge from-layer="1" from-port="1" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0" />
		<edge from-layer="3" from-port="1" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="19" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="28" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="25" to-port="0" />
		<edge from-layer="21" from-port="1" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0" />
		<edge from-layer="25" from-port="1" to-layer="26" to-port="0" />
		<edge from-layer="26" from-port="1" to-layer="27" to-port="0" />
		<edge from-layer="28" from-port="1" to-layer="29" to-port="0" />
		<edge from-layer="29" from-port="1" to-layer="30" to-port="0" />
	</edges>
	<statistics>
		<layer>
			<name>Mul_/Fused_Mul_/FusedScaleShift_</name>
			<min>-2.279965, -1.767808, -0.981326</min>
			<max>10.328615, 13.664273, 14.849474</max>
		</layer>
		<layer>
			<name>Mul_1005/FusedScaleShift_</name>
			<min>-0.235987, -0.171697, -0.140349, -0.178437, -0.213995, -0.099510, -0.234117, -0.213878, -0.450369, -0.138820, -0.170855, -0.203518, -0.212354, -0.144621, -0.184636, -0.203324, -0.178073, 0.000000, -0.215523, -0.164217, -0.191155, -0.197398, -0.390240, -0.194270, -0.143768, -0.170558, -0.202658, -0.215967, -0.164702, -0.160880, -0.223700, -0.151952, -0.182299, -0.176989, -0.179133, -0.209774, -0.139448, -0.180910, -0.386255, -0.203460, -0.156029, -0.170319, -0.302593, -0.198604, -0.186484, -0.258886, -0.140515, -0.143499, -0.155608, -0.185608, -0.186420, -0.184058, -0.193147, -0.187535, -0.159367, -0.178280, -0.207375, -0.163266, -0.195242, 0.000000, -0.169845, -0.158481, -0.220442, -0.178941, -0.238716, -0.214869, 0.000000, -0.213676, -0.187558, -0.231446, -0.149273, -0.291805, -0.157182, -0.186534, -0.186442, -0.157672, -0.462789, 0.000000, -0.172507, -0.150422, -0.168903, -0.215411, -0.147298, -0.257564, -0.192405, -0.161762, -0.171950, -0.232500, -0.237529, -0.559401, -0.225252, -0.226695, -0.302685, -0.108680, -0.161610, -0.175315, -0.134642, -0.171903, -0.167083, 0.000000, -0.187197, -0.198734, -0.177792, -0.176127, -0.184308, -0.143050, -0.194889, -0.172107, -0.183492, -0.254828, -0.181438, -0.237080, -0.214792, -0.193889, -0.157063, -0.106263, -0.221285, -0.220076, -0.220660, -0.158221, -0.201999, -0.135401, -0.146942, -0.195712, -0.219544, -0.155509, -0.168044, 0.000000, -0.249598, -0.206129, -0.488849, -0.147683, -0.248260, -0.165023, -0.143471, -0.147700, -0.132555, -0.162901, -0.147198, -0.364712, 0.000000, -0.188061, -0.196676, -0.188150, -0.143857, 0.000000, -0.157390, -0.185158, -0.226519, -0.183026, -0.152325, -0.179172, -0.192614, -0.267033, -0.183445, -0.369344, -0.133568, -0.179355, -0.386947, -0.172587, -0.231926, -0.253205, -0.126303, -0.175771, -0.170086, -0.172574, -0.145434, -0.195384, -0.173810, 0.000000, -0.202327, -0.140041, -0.231047, -0.137640, -0.227678, 0.000000, -0.177139, -0.157323, -0.201023, -0.214041, -0.164713, -0.201491, -0.134448, -0.266983, -0.180075, -0.308357, -0.252362, -0.218788, -0.250584, -0.196589, -0.206014, -0.133494, -0.256937, 0.000000, -0.236310, -0.179414, -0.180079, -0.199539, -0.238744, -0.140492, -0.203689, -0.121279, -0.203712, -0.162934, -0.199780, -0.174599, -0.169579, -0.204460, -0.255420, -0.178307, -0.230621, -0.173764, 0.000000, -0.178700, -0.196863, -0.179611, -0.192894, -0.218354, -0.205061, -0.238343, -0.176522, -0.170796, -0.176572, 0.000000, -0.190787, -0.167217, -0.206294, -0.198810, -0.220694, -0.159826, -0.304988, -0.180425, -0.180802, -0.178558, -0.196649, -0.209225, -0.388742, -0.140588, -0.178824, -0.197021, -0.124414, -0.184024, -0.163563, -0.200260, -0.190343, -0.211427, -0.210205, -0.248570, -0.235509, -0.141873, -0.206181, -0.176008, -0.161421, -0.172550, -0.176141, -0.196768</min>
			<max>5.224725, 8.906940, 0.977975, 8.819434, 5.913077, 9.329332, 2.679888, 7.288318, 2.800261, 10.434284, 6.998177, 7.608877, 2.584949, 8.249564, 3.906106, 6.316895, 7.568997, 0.000000, 4.295229, 7.568194, 7.757399, 4.465329, 3.588141, 7.963973, 5.670213, 4.890597, 2.035172, 5.081312, 10.437256, 9.838631, 8.520850, 3.190585, 4.908874, 6.978928, 4.729943, 4.741691, 13.878864, 9.975630, 4.383298, 5.924356, 8.241345, 6.355239, 3.550824, 9.758850, 7.383569, 3.534926, 12.463593, 10.896960, 4.675252, 9.275108, 4.351924, 4.392128, 5.995016, 9.620456, 5.545390, 6.853853, 11.296999, 7.497891, 8.393148, 0.000000, 4.667934, 6.718774, 7.103370, 10.506428, 6.398783, 6.802834, 0.000000, 4.801240, 6.115143, 5.617013, 6.437879, 2.737335, 8.335580, 7.448165, 8.820330, 8.420711, 4.445097, 0.000000, 5.128314, 6.581546, 7.267928, 5.431066, 2.224750, 2.267582, 5.608366, 7.189717, 8.715980, 4.235596, 7.438987, 2.458733, 4.864590, 6.329056, 2.663970, 8.341814, 8.441923, 4.797287, 7.190818, 4.109458, 8.792411, 0.000000, 5.905508, 6.126463, 5.818521, 6.674011, 7.656570, 8.314390, 2.607574, 9.261950, 6.235591, 5.273214, 3.840429, 7.655257, 6.429554, 7.264464, 4.633787, 6.597561, 6.006593, 5.688690, 3.024985, 3.793757, 9.197309, 3.122759, 5.099548, 4.465908, 6.997815, 5.017436, 14.684394, 0.000000, 5.391791, 6.449238, 4.564005, 5.785256, 6.217601, 2.020278, 9.641853, 6.847138, 0.595195, 8.244338, 1.495380, 5.362327, 0.000000, 2.928643, 6.460606, 7.685753, 6.135058, 0.000000, 6.540130, 6.077528, 6.860724, 5.658219, 7.742128, 7.806469, 7.089824, 5.744501, 3.693512, 3.995793, 3.192874, 4.793134, 2.641957, 2.727488, 6.407077, 2.702896, 4.557948, 5.307768, 5.958817, 8.065750, 3.333588, 6.999660, 6.992700, 0.000000, 7.466347, 10.409163, 4.186779, 6.957401, 4.088763, 0.000000, 4.161049, 7.226867, 10.500932, 4.974417, 5.416234, 5.565066, 10.084586, 6.163873, 7.201324, 4.139229, 5.338914, 4.265529, 3.979674, 6.394054, 7.328360, 7.579932, 1.080309, 0.000000, 3.089041, 3.330539, 11.482842, 6.344293, 5.423049, 6.776314, 6.897288, 1.619105, 6.079478, 4.783695, 4.870094, 9.596663, 6.666651, 9.551964, 4.751639, 6.436151, 5.629406, 2.750330, 0.000000, 5.925819, 4.593825, 6.562523, 8.134861, 3.436834, 5.564449, 5.108992, 8.548185, 4.293838, 6.580438, 0.000000, 6.276441, 4.672279, 2.133321, 6.986449, 2.043629, 3.824578, 3.678991, 4.018684, 3.901659, 6.464394, 3.628305, 5.161393, 2.832700, 2.761580, 4.708974, 4.218777, 8.395827, 4.195696, 6.007259, 5.131279, 5.701887, 6.147721, 9.128352, 4.191236, 6.091598, 6.755419, 5.967377, 4.548358, 8.065769, 7.697366, 3.337573, 4.275369</max>
		</layer>
		<layer>
			<name>Mul_1011/FusedScaleShift_</name>
			<min>-0.174398, -0.156213, -0.129403, -0.303747, -0.364597, -0.072126, -0.220110, -0.204103, -0.248422, -0.536667, -0.143241, -0.082027, -0.079454, -0.163629, -0.321549, -0.104193, -0.317421, -0.269093, -0.121625, -0.155603, -0.342811, -0.136685, -0.258772, -0.287424, -0.054333, -0.174562, -0.379094, -0.032511, -0.094033, -0.307559, -0.266559, -0.187919, -0.172932, -0.367960, -0.154260, -0.378970, -0.187056, -0.114830, -0.315358, -0.154235, -0.304791, -0.238537, -0.354889, -0.220747, -0.516015, -0.183297, -0.132113, -0.143736, -0.117556, -0.160924, -0.210585, -0.393565, -0.236178, -0.279392, -0.128373, -0.242143, -0.083360, -0.379084, -0.231361, -0.294180, -0.128758, -0.163077, -0.242697, -0.191867, -0.096800, -0.188964, -0.487430, -0.163364, -0.352040, -0.277143, -0.419069, -0.350744, -0.084493, -0.132452, -0.137483, -0.308753, -0.115786, -0.249395, -0.120266, -0.083197, -0.299726, -0.144354, -0.176827, -0.088120, -0.186071, -0.188193, -0.078603, -0.086090, -0.160955, -0.199422, -0.089288, -0.233839, -0.359730, -0.400561, -0.139048, -0.366030, -0.237989, -0.273557, -0.142467, -0.274230, -0.257926, -0.159451, -0.133421, -0.213104, -0.176398, -0.440025, -0.269052, -0.298554, -0.113886, -0.134067, -0.171051, -0.219734, -0.264691, -0.436620, -0.476942, -0.189033, -0.207511, -0.184658, -0.165802, -0.114979, -0.354761, -0.145493, -0.304127, -0.426182, -0.114747, -0.139700, -0.163918, -0.336987</min>
			<max>12.735836, 14.898872, 23.782530, 8.840071, 5.449254, 37.941158, 9.854207, 13.702653, 8.772471, 4.904938, 13.462519, 5.878693, 28.932871, 12.170127, 5.678633, 25.266167, 5.499040, 8.369995, 16.170033, 5.114420, 5.183509, 15.572524, 6.188308, 9.098242, 4.445148, 10.776914, 3.015383, -0.032511, 13.920949, 5.891828, 8.841508, 16.389647, 4.468526, 6.725836, 6.529896, 6.352001, 11.845361, 22.217667, 6.092136, 2.763515, 4.756655, 8.542758, 7.316039, 13.432753, 8.778788, 14.569617, 8.921316, 13.021741, 14.770960, 11.062921, 7.686823, 5.025353, 7.696638, 8.056985, 17.721325, 9.216956, 31.206915, 6.659327, 8.529902, 4.794962, 2.384494, 13.593802, 10.046899, 11.595909, 12.462457, 12.739947, 4.254858, 13.311328, 7.389213, 9.611115, 6.613468, 3.649799, 19.561935, 16.128160, 19.231628, 4.131024, 8.370113, 10.477764, 17.768599, 13.508848, 8.183440, 10.784749, 16.300968, 22.825315, 11.472209, 6.738248, 38.807148, 18.371563, 18.465437, 13.313272, 20.818457, 10.925594, 7.854416, 7.540886, 11.753855, 5.635691, 10.446231, 8.332161, 11.508826, 7.045107, 8.756450, 9.469973, 10.970792, 11.373887, 14.591879, 5.490743, 5.154733, 2.830355, 18.902664, 14.636043, 15.465705, 6.498303, 11.272814, 6.464451, 6.262028, 14.067936, 12.408998, 19.745413, 12.952993, 13.383386, 4.566927, 8.664398, 7.379465, 6.910048, 10.139669, 12.026447, 16.022474, 4.933304</max>
		</layer>
		<layer>
			<name>Mul_1014/FusedScaleShift_</name>
			<min>-0.310268, -0.476623, -0.370141, -0.506291, -0.375556, -0.438705, -0.469988, -0.403028, -0.281539, -0.475378, -0.371847, -0.294104, -0.314899, -0.470753, -0.342355, -0.469389, -0.462586, -0.471962, -0.412556, -0.415164, -0.285087, -0.469965, -0.443916, -0.402204, -0.390064, -0.465774, -0.504087, -0.506912, -0.359432, -0.364938, -0.345316, -0.368862, -0.500471, -0.621922, -0.445301, -0.322586, -0.357050, -0.227345, -0.413616, -0.373929, -0.352286, -0.473229, -0.289516, -0.363581, -0.210239, -0.438596, -0.319418, -0.337936, -0.193944, -0.406084, -0.479041, -0.383614, -0.385260, -0.458904, -0.260775, -0.307801, -0.333032, -0.413802, -0.380357, -0.254840, -0.339161, -0.420134, -0.328253, -0.408986, -0.242517, -0.311388, -0.412961, -0.405243, -0.258177, -0.242052, -0.433630, -0.189971, -0.183100, -0.433388, -0.631426, -0.516273, -0.392197, -0.430119, -0.357962, -0.452846, -0.413071, -0.318178, -0.195221, -0.447194, -0.345319, -0.470029, -0.510294, -0.448181, -0.553933, -0.291153, -0.304301, -0.372579, -0.372898, -0.389591, -0.333998, -0.520884, -0.439501, -0.449965, -0.238688, -0.371989, -0.490968, -0.377143, -0.512870, -0.435511, -0.408478, -0.413692, -0.397143, -0.390843, -0.440869, -0.497782, -0.332400, -0.409621, -0.421218, -0.234736, -0.478426, -0.403640, -0.451279, -0.479721, -0.252865, -0.406551, -0.399656, -0.357896, -0.450260, -0.351330, -0.437553, -0.327660, -0.168603, -0.410561</min>
			<max>3.861649, 5.196592, 6.835929, 5.696732, 5.776313, 6.945470, 2.996144, 5.858069, 7.775591, 6.910196, 5.911395, 4.459995, 5.695910, 5.543424, 7.988680, 4.385633, 3.428385, 4.467835, 4.165109, 4.906309, 8.830709, 3.334447, 4.806154, 4.110634, 4.588861, 5.925571, 4.401913, 3.962271, 6.520801, 3.213868, 3.924959, 5.568879, 4.943578, 5.203250, 5.260423, 4.982755, 6.384663, 11.149075, 5.363720, 5.240426, 4.659733, 5.337746, 6.395226, 5.859666, 6.724747, 6.279140, 3.130989, 6.033413, 3.107036, 5.817715, 4.115639, 6.136445, 5.126601, 5.366585, 6.858837, 7.009106, 3.884066, 3.298189, 4.200108, 6.811863, 7.088585, 6.047583, 8.005239, 9.522372, 5.863414, 9.919594, 6.612953, 4.779287, 6.055982, 3.106888, 3.787026, 2.619871, 6.767051, 2.811285, 3.776142, 4.900827, 4.774689, 6.727067, 7.245202, 4.573473, 7.239406, 7.105914, 3.048970, 5.453278, 7.038207, 3.457040, 5.329046, 7.173358, 5.154689, 4.142023, 6.567856, 4.611778, 7.488533, 6.684679, 4.720536, 4.019473, 6.715220, 4.331905, 7.126222, 6.036946, 7.427757, 5.010769, 5.418440, 2.717256, 3.976962, 5.911948, 3.235961, 4.292281, 4.060549, 3.931566, 6.834787, 5.050726, 4.654276, 3.842317, 6.538860, 3.433523, 3.548595, 3.606996, 6.260547, 4.518588, 5.579903, 6.418801, 4.554693, 5.828920, 5.720321, 5.743800, 1.583998, 5.345335</max>
		</layer>
		<layer>
			<name>Mul_990/FusedScaleShift_</name>
			<min>-0.257477, -0.720593, -0.575267, -0.329450, -0.338182, -0.642775, -0.741861, -0.233543, -0.605312, -0.222677, -0.338808, -0.214751, -0.264674, -0.553350, -0.566547, -0.620641, -0.741759, -0.363119, -0.244806, -0.182979, -0.517078, -0.330867, -0.268878, -0.703369, -0.216959, -0.331745, -0.424957, -0.393275, -0.364181, -0.635921, -0.332647, -0.322474, -0.216883, -0.352082, -0.272187, -0.553506, -0.436308, -0.249546, -0.273735, -0.558075, -0.689657, -0.368924, -0.255182, -0.416987, -0.459612, -0.414634, -0.429915, -0.473848, -0.212910, -0.270324, -0.692801, -0.384506, -0.378567, -0.294875, -0.379531, -0.262425, -0.337172, -0.420118, -0.565965, -0.264076, -0.362497, -0.342764, -0.402615, -0.503290</min>
			<max>12.782198, 5.346651, 4.302137, 6.344147, 9.890784, 7.239223, 4.385190, 9.345882, 6.041879, 7.237128, 11.433807, 10.796941, 9.568570, 5.362775, 7.177367, 9.619039, 3.980524, 7.335952, 7.391960, 8.306660, 5.756916, 7.878659, 11.475004, 2.699536, 9.157248, 9.772148, 5.995893, 6.224141, 13.507658, 6.715310, 7.140606, 9.016501, 11.254354, 5.463434, 8.555597, 5.190276, 7.147224, 10.928663, 10.473798, 5.977820, 5.188001, 11.886499, 10.230103, 9.615868, 9.909610, 6.462021, 8.581488, 8.729245, 6.843634, 10.512803, 5.430967, 8.809682, 5.019753, 10.317791, 13.704699, 10.908867, 14.102391, 9.307843, 6.862213, 8.439540, 3.808822, 9.887820, 7.456206, 5.564388</max>
		</layer>
		<layer>
			<name>Mul_999/FusedScaleShift_</name>
			<min>-0.441348, -0.275469, -0.121187, -0.450037, -0.345325, -0.468976, -0.400141, -0.357969, -0.531799, -0.077887, -0.556819, -0.584838, -0.426426, -0.310271, -0.629439, -0.274839, -0.453145, -0.126563, -0.635093, -0.522513, -0.568271, -0.501174, -0.474109, -0.259788, -0.262088, -0.231325, -0.065465, -0.373745, -0.209894, -0.566029, -0.749012, -0.289044</min>
			<max>9.128840, 12.637056, 12.782495, 6.179503, 5.592625, 10.039634, 8.305590, 4.273253, 8.441664, 9.971824, 8.365820, 7.604854, 3.498223, 1.914660, 4.760655, 12.119784, 11.412988, 13.623595, 6.547807, 9.473743, 8.791762, 9.428425, 7.674652, 13.944048, 10.582544, 3.773091, 6.300732, 5.320750, 10.884342, 8.065225, 7.730911, 13.251246</max>
		</layer>
		<layer>
			<name>angle_p</name>
			<min>-3.158309, -3.104862, -6.786241, -3.348094, -3.418554, -3.389095, -3.852452, -2.555483, -3.292211, -2.577747, -3.281856, -4.319308, -3.023605, -4.994850, -3.162403, -6.503336, -3.696364, -3.386971, -3.065738, -3.363015, -0.739699, -2.921521, -3.426758, -2.461708, -4.428724, -3.149132, -3.109335, -3.341251, -3.128164, -3.270772, -3.219656, -2.372144, -3.612434, -3.629489, -1.060455, -0.868397, -3.931216, -3.299392, -3.245985, -3.035556, -3.010803, -3.355695, -3.138477, -3.606217, -4.423249, -4.168815, -3.291264, -4.046439, -3.328728, -4.067328, -3.237052, -3.330536, -3.250479, -4.256233, -5.611029, -3.152519, -3.394509, -4.225335, -3.164133, -3.371185, -3.417006, -3.515980, -3.082418, -3.146768, -2.354884, -3.224440, -3.812412, -4.292393, -3.711978, -3.323095, -3.387061, -2.646669, -3.969782, -3.445937, -3.243097, -3.650795, -2.979195, -3.212508, -1.334193, -4.053249, -5.286591, -3.724143, -2.280010, -3.793734, -3.239010, -3.222330, -3.240631, -3.005209, -4.047597, -3.302186, -0.942980, -6.350167, -3.242120, -1.760282, -3.397300, -3.800673, -3.277156, -3.307750, -3.888454, -3.628381, -3.643536, -3.528296, -3.358884, -3.242795, -3.340151, -3.368513, -3.349521, -3.782915, -2.940959, -3.385785, -2.969705, -3.095518, -3.349719, -3.281045, -3.841946, -3.152148, -3.288694, -3.328781, -3.634229, -3.416756, -3.164288, -6.610399, -3.331262, -1.808483, -0.988124, -3.430157, -3.161420, -3.382800</min>
			<max>4.488203, 4.753203, 0.131132, 3.583800, 3.510664, 3.665000, 2.153364, 7.371187, 3.476267, 7.238375, 3.575183, 2.800617, 5.073902, 1.574628, 4.398224, 0.088148, 3.052162, 3.523813, 4.759950, 4.864238, 10.051238, 7.178423, 3.520748, 7.392128, 1.261059, 4.367105, 4.481477, 3.601484, 4.433994, 4.303711, 3.630688, 7.280632, 1.292751, 2.910458, 4.114505, 9.703876, 2.553436, 3.686253, 3.533253, 5.160666, 2.785408, 3.612005, 4.424638, 3.130481, 1.903310, 2.271230, 3.584873, 1.461106, 4.340487, 1.295560, 3.603194, 3.609807, 3.742195, 3.018269, 1.263244, 4.398932, 3.630697, 1.417351, 5.082541, 3.569160, 3.676815, 5.342575, 5.162130, 4.357476, 7.188602, 4.319244, 1.057135, 2.823770, 1.302668, 3.622230, 3.727638, 7.144196, 2.636170, 3.456561, 3.621582, 1.602605, 5.049189, 3.704756, 8.498533, 3.671790, 0.196509, 2.922648, 7.203861, 1.035159, 4.272776, 4.385402, 3.681227, 5.188996, 3.302511, 3.707276, 5.140208, 0.877827, 3.693251, 7.767170, 3.484304, 1.038187, 3.696750, 3.627677, 1.308080, 1.078923, 1.556614, 5.475872, 3.569882, 3.722183, 3.513858, 3.712733, 3.577270, 1.350172, 5.077892, 3.562495, 5.063650, 4.431030, 3.579459, 3.590068, 1.384638, 4.419537, 3.569917, 3.617206, 2.132689, 3.515138, 4.338257, 1.104323, 3.522205, 7.882722, 9.614034, 3.513697, 4.397923, 3.700354</max>
		</layer>
		<layer>
			<name>angle_r</name>
			<min>-1.763645, -2.783027, -1.817291, -2.103998, -2.220705, -1.022322, -1.716797, -1.928335, -1.999123, -1.986652, -1.881670, -1.286682, -2.072612, -1.728637, -1.465541, -1.272567, -1.748984, -2.038285, -1.405112, -1.903143, -2.143110, -1.938836, -1.296296, -2.001936, -1.777957, -1.464985, -1.460976, -1.213971, -1.377355, -1.808000, -1.903432, -2.125791, -1.996582, -2.010439, -1.394520, -1.056924, -2.340013, -1.498356, -0.889383, -1.370852, -1.767135, -1.989584, -2.115303, -2.104357, -1.426137, -1.907903, -2.122463, -1.745732, -1.117938, -1.743781, -1.872006, -1.525014, -2.124759, -1.806638, -1.677213, -1.747862, -1.638817, -2.186344, -1.760470, -1.838835, -1.543513, -2.133012, -1.811728, -1.722016, -1.901450, -1.778776, -1.890346, -1.811755, -2.333078, -1.839497, -1.842227, -1.971079, -1.860959, -1.957508, -1.985231, -1.428742, -1.936849, -1.784798, -1.932214, -1.785616, -1.473447, -1.811181, -1.988645, -2.122111, -1.760464, -1.986079, -1.922708, -1.873656, -1.827518, -2.148111, -1.891664, -1.665220, -1.304222, -1.936191, -1.858202, -1.896909, -1.794139, -1.939231, -1.948277, -1.930547, -1.994741, -2.157303, -1.998350, -1.775445, -1.645410, -1.927375, -1.938421, -1.883336, -1.895247, -1.967769, -1.753160, -1.849989, -1.779395, -1.991143, -1.807935, -1.815876, -2.120172, -1.982975, -0.534113, -1.869608, -2.061410, -1.966802, -1.755049, -1.734149, -1.807442, -2.177078, -2.139480, -2.124023</min>
			<max>1.360165, 1.952277, 1.462903, 0.822006, 1.768345, 1.998878, 1.380097, 1.122362, 1.065989, 1.349084, 1.392204, 2.126407, 1.913328, 1.035765, 1.120754, 1.777842, 1.479802, 0.868441, 2.034869, 1.028306, 0.764788, 0.869308, 1.259392, 0.763651, 0.927226, 1.108952, 2.050748, 1.270978, 1.522646, 0.983712, 0.883523, 1.021584, 1.562712, 0.812571, 1.685427, 1.796181, 1.381845, 1.681915, 1.860077, 1.546997, 1.174958, 1.008495, 1.006235, 0.937719, 1.218506, 0.810696, 0.910177, 1.373652, 1.900582, 0.945632, 1.767408, 1.483393, 1.884898, 1.104067, 1.542018, 1.322364, 1.265170, 0.960824, 1.376334, 0.828618, 1.694194, 1.623121, 1.407075, 1.397793, 0.890680, 1.063596, 0.830264, 1.124086, 2.130687, 1.081552, 0.928183, 1.135503, 1.349375, 0.900309, 0.849954, 1.558339, 0.799147, 1.466368, 1.125018, 0.858706, 0.986093, 0.999992, 1.016745, 0.886752, 0.914985, 1.719070, 0.869442, 1.297077, 1.216441, 1.017308, 0.993946, 1.584644, 1.108304, 1.016726, 0.940940, 0.967078, 0.952887, 1.718779, 1.198048, 1.052900, 0.854865, 1.093809, 0.979249, 1.300853, 1.340121, 0.757755, 0.874456, 1.659219, 0.891218, 0.907588, 0.943194, 0.835054, 1.046637, 1.447684, 0.899012, 0.809374, 1.103029, 1.094697, 2.188489, 1.049720, 0.862814, 0.765029, 0.996013, 0.986799, 0.995469, 0.883308, 1.096477, 0.824019</max>
		</layer>
		<layer>
			<name>angle_y</name>
			<min>-2.697779, -2.974983, -3.272621, -3.822916, -2.841997, -3.311812, -3.340944, -4.072965, -2.997242, -3.365556, -3.570049, -3.831905, -3.254681, -2.974048, -3.458152, -3.970342, -4.104102, -3.824503, -3.393146, -4.107142, -3.354561, -2.560891, -3.259387, -3.467361, -2.834979, -4.173106, -4.340570, -5.332268, -3.859213, -4.324313, -3.741417, -4.013742, -2.749789, -4.131519, -2.865618, -2.836811, -2.755760, -2.946973, -3.118737, -4.907291, -1.911671, -2.885567, -2.862918, -2.875098, -4.526608, -3.408496, -4.186523, -3.272993, -3.242130, -3.087717, -3.384846, -2.907384, -4.613195, -4.354628, -3.941918, -5.608703, -3.000525, -3.833910, -3.318878, -2.859984, -3.259757, -3.391125, -3.083359, -4.725738, -5.640237, -3.226499, -5.294257, -4.934035, -2.867887, -2.833774, -3.228557, -3.340596, -4.655137, -4.202667, -2.634489, -3.252861, -3.006654, -4.165164, -3.806967, -3.239141, -2.612161, -3.279664, -4.088816, -5.876236, -4.239968, -3.197531, -4.028699, -4.207358, -3.084755, -2.550088, -3.242215, -4.929175, -4.602510, -3.244490, -3.267125, -3.147778, -5.904126, -3.844541, -3.023266, -4.524434, -2.508426, -3.236546, -5.395704, -4.279135, -5.388490, -2.063732, -3.277056, -3.246873, -3.244947, -4.793440, -3.330806, -2.725502, -3.356395, -3.359155, -3.215303, -3.289234, -3.738642, -3.060732, -3.875063, -3.039532, -3.470564, -3.337857, -4.217439, -3.860207, -3.238084, -3.222810, -5.869552, -3.929082</min>
			<max>3.280750, 3.929024, 6.542160, 4.755165, 3.376262, 2.825797, 6.316867, 3.498253, 5.066495, 6.208268, 3.547913, 3.047214, 2.864503, 3.757619, 2.826845, 1.993237, 3.522620, 4.743523, 6.533172, 1.961711, 6.204464, 3.499952, 6.102203, 6.222513, 4.029241, 3.424683, 3.501820, 2.741704, 2.818202, 3.545492, 4.941737, 3.536669, 3.769537, 3.409463, 4.167660, 4.099875, 3.084375, 4.273466, 2.954815, 3.488964, 7.854207, 4.113581, 4.303833, 4.272269, 2.372549, 6.330979, 3.445971, 6.380547, 6.004655, 3.160763, 6.248190, 3.942001, 1.855578, 3.640811, 3.589791, 2.716282, 4.097388, 3.242264, 6.303400, 4.168577, 6.274279, 6.245706, 3.789136, 2.444321, 1.364786, 2.845027, 2.743799, 2.300164, 4.208337, 4.374966, 6.353876, 6.315255, 2.243327, 3.466526, 4.495806, 2.854445, 4.429737, 3.428306, 5.397981, 6.063508, 4.340550, 6.235704, 3.544991, 1.446290, 3.384392, 6.278975, 4.560313, 3.409950, 4.359105, 3.556038, 6.437602, 2.393012, 2.195915, 6.175706, 6.367864, 4.023282, 1.502807, 0.480666, 5.300631, 2.249286, 2.759273, 6.518907, 2.773510, 3.413368, 2.622764, 7.938367, 6.262304, 6.392665, 6.274229, 3.252029, 6.107342, 4.146039, 6.203437, 6.388404, 5.995864, 2.934737, 2.573447, 2.940776, 3.206535, 3.886117, 6.433591, 6.519615, 3.444598, 2.470005, 6.043953, 6.159286, 1.900236, 2.426277</max>
		</layer>
		<layer>
			<name>conv1</name>
			<min>-19.240120, -58.284065, -27.808760, -29.495516, -31.603106, -40.163631, -24.439159, -30.513020, -43.548706, -19.550407, -48.266590, -16.544468, -22.737938, -36.462723, -10.105216, -68.139099, -38.441238, -27.292690, -12.468097, -39.186234, -46.911983, -47.836037, -23.413620, -67.903763, -68.188034, -68.822037, -16.549385, -34.928848, -36.068260, -50.612251, -14.476989, -54.070999</min>
			<max>25.399300, 72.212616, 16.926828, 8.165747, 13.405549, 45.903465, 22.480072, 4.011878, 50.414047, 10.659812, 48.641682, 17.133600, 16.138443, 2.112778, 20.713484, 48.600056, 58.159992, 17.607786, 19.024729, 45.044582, 56.324345, 45.928730, 22.647339, 57.353409, 44.061668, 3.109657, 8.214402, 7.789657, 15.934917, 50.803886, 25.435099, 72.653099</max>
		</layer>
		<layer>
			<name>conv2</name>
			<min>-118.193466, -137.200073, -73.908035, -77.956451, -146.256943, -86.179230, -99.239929, -83.267410, -54.285175, -96.393723, -128.868134, -70.805565, -83.974213, -155.686203, -125.883911, -145.684616, -68.795937, -100.874565, -75.109215, -112.709854, -127.042763, -88.341049, -83.161697, -74.889870, -77.239220, -108.701431, -139.254227, -93.104507, -101.207375, -85.253647, -60.101681, -113.381065, -93.354156, -80.413322, -116.244530, -183.984543, -79.989677, -106.902679, -112.834244, -133.968292, -152.905594, -135.451324, -97.260231, -89.377281, -99.209930, -151.588501, -132.478607, -102.655540, -121.685043, -111.830666, -241.923080, -99.167816, -89.325111, -47.469917, -123.441032, -87.645050, -135.135498, -104.687721, -120.414009, -61.009300, -80.469788, -87.842850, -49.583401, -176.221603</min>
			<max>56.174751, 34.196140, 39.565578, 62.499165, 34.833984, 71.718987, 42.817497, 41.428921, 71.699402, 44.349567, 60.725880, 51.357559, 35.323341, 32.010693, 35.026489, 54.277069, 31.698639, 68.221695, 39.498569, 28.440878, 39.424698, 32.837490, 45.245819, 31.886623, 28.739813, 60.769676, 28.715689, 67.804367, 81.830673, 39.728500, 65.516632, 44.294426, 37.416859, 48.590450, 59.560543, 24.470648, 43.967014, 33.575115, 40.427998, 33.678036, 35.308834, 50.607944, 39.594772, 38.147999, 38.864929, 29.304558, 38.708649, 35.146114, 15.398937, 50.235676, 33.623730, 51.849243, 41.951950, 50.693794, 84.294075, 51.354324, 83.163834, 39.351185, 34.276253, 40.796391, 50.825443, 39.332199, 39.714840, 31.248329</max>
		</layer>
		<layer>
			<name>conv3</name>
			<min>-21.845411, -23.093857, -19.705637, -25.596455, -13.614545, -23.145979, -19.229889, -23.373966, -18.851948, -39.478813, -23.243853, -63.729179, -23.716827, -23.539131, -16.321930, -26.049484, -13.773511, -28.383217, -26.294596, -27.336819, -16.209023, -26.350817, -31.745163, -33.096924, -27.051105, -29.511356, -11.209704, -38.105034, -29.678221, -20.530872, -28.061512, -20.855742, -22.573265, -25.088415, -24.859142, -29.883968, -21.597107, -21.426586, -20.288956, -26.364956, -20.380898, -20.710316, -45.874397, -20.215239, -17.466343, -28.693138, -27.274372, -31.187405, -25.201412, -21.862812, -21.511925, -21.573603, -20.981907, -13.341534, -27.784840, -26.688705, -23.523254, -27.406898, -22.697857, -24.855371, -34.847183, -22.038471, -24.089624, -24.433212, -25.141161, -23.717127, -17.038782, -23.599764, -39.755245, -25.014206, -27.580637, -9.283923, -24.274015, -20.973629, -29.237160, -13.077697, -37.946281, -23.475626, -29.010965, -30.318779, -22.736372, -21.872572, -16.779833, -25.976875, -28.667614, -27.262302, -25.116909, -23.460461, -21.985001, -29.068331, -22.849062, -15.294559, -32.001541, -28.017675, -25.683018, -25.626610, -16.679062, -17.518509, -36.717651, -17.013577, -35.930912, -27.193085, -22.193840, -32.047951, -19.597673, -36.604515, -16.737885, -25.003389, -20.986961, -22.153769, -30.805969, -25.312252, -17.408459, -44.232800, -42.619781, -21.321688, -21.528778, -23.827366, -25.214941, -21.705490, -22.363125, -27.868698, -23.349241, -33.546249, -24.763367, -27.769009, -18.906084, -31.467976</min>
			<max>8.334989, 9.454703, 17.220490, 10.795506, 27.136261, 11.189439, 12.952312, 13.017912, 11.772123, 13.343927, 6.976647, 1.869766, 9.028817, 11.856024, 8.316868, 12.332710, 8.311522, 11.333550, 7.118574, 2.748682, 8.676738, 8.882025, 5.193051, 14.330582, 1.154069, 6.940367, 10.391993, -1.243975, 5.458066, 8.510211, 11.589832, 11.332962, 4.032651, 13.163894, 4.078283, 10.130216, 11.230316, 12.813623, 10.901162, 2.048045, 6.263229, 8.106018, 12.235317, 13.911205, 22.182579, 10.886613, 5.236789, 8.406922, 7.473935, 7.661763, 7.767857, 9.924790, 8.020941, 11.949794, 9.629192, 10.640291, 9.369860, 13.189396, 8.729922, 7.081441, 1.200491, 9.639934, 10.800379, 9.715948, 4.661017, 10.816578, 13.298095, 9.371210, 12.799221, 13.868494, 15.082907, 12.780050, 6.297740, 11.486575, 8.758383, 10.508889, 3.359229, 13.568031, 9.193514, 5.402456, 12.086181, 7.572007, 16.227156, 9.965118, 10.501366, 5.173896, 14.419497, 7.433454, 10.199739, 11.165915, 8.476481, 12.067204, 11.492879, 12.399172, 6.998938, 10.115469, 14.222994, 13.102678, 5.394898, 10.741332, 11.058421, 8.167379, 7.022424, 10.544418, 14.008183, 12.492818, 12.163229, 4.590543, 9.682085, 9.523672, 16.631968, 7.948650, 15.223010, 14.639276, 14.047243, 10.952003, 12.679830, 15.387993, 9.523503, 6.387720, 17.032875, 4.163689, 10.378686, 14.072341, 5.994962, 5.734126, 13.754610, 7.175532</max>
		</layer>
		<layer>
			<name>conv4</name>
			<min>-55.093628, -77.761452, -62.855087, -51.200451, -45.399132, -52.642570, -58.059841, -37.852512, -44.432236, -38.012184, -62.144844, -54.545296, -47.176247, -71.942680, -51.773792, -35.166489, -47.586853, -42.151283, -45.095238, -76.557030, -63.755661, -40.175682, -23.589642, -54.620625, -48.089706, -73.401001, -41.742027, -74.097618, -75.242638, -42.581100, -56.692757, -58.691662, -55.575180, -12.538767, -37.816853, -49.725533, -72.219933, -54.411888, -62.342766, -42.651852, -45.291557, -59.991795, -53.775658, -83.839417, -46.506416, -100.275146, -43.283096, -54.475094, -51.402878, -61.100285, -34.401848, -59.581039, -38.863819, -72.781769, -46.392792, -68.026352, -43.961807, -39.167992, -53.505051, -60.640095, -61.477451, -40.479034, -35.169533, -61.084602, -42.292435, -50.619682, -53.669106, -48.417213, -40.411343, -60.104973, -47.147659, -47.029415, -52.822231, -40.219376, -52.428978, -46.873650, -39.379467, -46.645828, -52.402954, -71.346397, -79.048492, -57.863907, -60.815147, -66.781143, -45.531326, -51.001266, -57.661598, -48.290749, -37.818432, -51.955784, -37.916836, -45.156708, -53.669552, -44.352703, -53.225769, -46.531845, -64.202591, -38.061844, -53.607590, -80.646744, -60.826385, -49.449623, -55.242058, -32.443680, -55.056007, -60.766701, -43.110222, -50.204388, -52.763992, -36.658100, -61.527023, -61.937401, -45.643234, -50.296524, -39.445396, -42.262939, -50.361324, -50.352097, -52.970558, -50.496399, -69.871239, -55.585571, -55.652744, -43.381203, -76.373314, -44.872074, -60.188908, -52.855324</min>
			<max>25.949076, 40.582630, 54.773468, 47.895874, 30.168478, 54.803341, 22.544722, 39.767746, 52.970894, 50.005192, 46.684921, 20.876396, 37.237659, 45.298454, 49.274799, 34.637829, 27.625755, 36.403122, 28.428692, 37.218418, 60.662464, 22.430605, 39.402054, 31.103739, 33.326607, 42.717720, 36.939209, 35.664871, 52.017334, 19.508287, 20.375380, 39.300552, 38.529694, 49.678917, 35.645573, 26.458776, 48.835976, 45.736794, 34.844128, 37.949032, 27.007977, 45.281918, 32.469597, 40.997238, 30.135323, 53.138607, 20.078157, 36.502563, 16.175556, 40.964714, 34.123760, 38.237957, 29.392223, 44.922112, 34.531742, 48.637489, 25.025087, 22.235096, 23.749098, 47.476143, 39.905777, 48.609947, 52.124985, 69.340790, 28.509949, 43.697899, 58.116402, 36.950600, 31.291544, 19.882010, 24.545765, 11.746243, 27.857716, 21.921902, 38.171436, 44.632412, 38.583424, 52.269257, 50.857346, 35.351898, 47.299725, 48.951874, 14.770081, 43.654182, 47.974426, 24.540836, 43.635639, 52.157818, 50.878578, 17.990131, 43.796803, 35.162327, 50.225121, 42.249550, 26.644930, 33.659206, 55.601521, 34.801727, 31.441628, 48.454239, 62.844650, 38.407967, 46.211174, 21.994247, 27.383204, 38.954494, 21.178076, 25.662901, 28.028028, 33.172779, 36.563599, 37.910065, 38.827259, 17.275068, 49.997208, 27.848457, 26.426289, 32.607986, 34.168594, 26.893402, 34.438919, 38.802509, 32.425655, 32.453548, 46.466061, 37.808273, 6.792946, 34.184925</max>
		</layer>
		<layer>
			<name>conv5</name>
			<min>-14.726172, -17.877131, -15.314781, -10.473966, -13.109604, -17.600630, -11.919960, -16.466024, -14.854279, -13.577534, -16.266253, -9.315858, -14.305589, -16.697397, -16.396807, -9.256128, -15.414263, -0.085650, -14.670375, -14.233101, -11.042585, -13.429148, -8.636307, -13.640457, -14.061951, -19.360062, -12.696377, -14.588358, -13.452395, -16.629532, -11.107109, -13.414179, -15.145751, -15.552899, -15.660907, -16.334650, -12.422508, -14.030933, -14.351522, -11.927138, -15.018496, -13.675653, -15.087198, -12.537919, -14.580088, -13.031901, -14.408167, -15.327591, -13.872571, -9.655129, -15.297698, -12.856339, -12.843427, -13.758424, -14.377749, -14.094201, -13.450372, -12.332743, -11.202849, -0.077181, -13.708253, -14.543813, -16.889502, -12.116636, -10.572993, -16.893438, -0.080150, -15.572992, -16.483477, -15.113186, -14.981203, -16.872210, -12.545876, -16.341713, -14.066357, -11.958704, -12.556175, -0.058071, -16.853956, -13.639529, -12.665835, -11.047163, -13.314518, -17.251028, -14.724444, -15.776911, -14.117823, -15.248095, -13.431439, -7.883605, -10.018993, -15.877312, -12.409743, -15.798262, -15.918904, -16.316971, -16.213671, -13.227581, -15.820913, -0.089129, -13.784328, -13.139608, -14.401422, -15.557207, -13.309179, -12.835061, -14.815466, -12.013171, -17.167610, -13.060542, -16.787552, -10.225179, -11.868417, -15.020639, -15.863471, -14.195329, -12.344492, -13.713429, -13.231483, -17.237408, -11.301803, -16.157784, -14.697503, -13.338861, -16.633698, -17.883106, -15.637291, -0.183145, -9.255583, -12.342732, -6.103687, -19.153727, -8.426995, -11.935246, -13.703188, -20.662727, -18.127094, -13.116682, -16.273331, -11.365358, -0.073967, -14.588418, -13.144369, -16.123903, -16.052364, -0.073887, -16.413683, -16.539295, -11.465261, -14.739291, -14.334501, -11.470587, -10.409255, -15.149727, -17.569239, -17.700579, -14.017357, -14.552873, -13.287991, -15.784023, -15.479124, -15.277282, -17.618673, -14.596468, -15.868259, -13.251479, -16.739508, -12.265446, -14.576252, -0.187787, -12.984749, -14.555982, -14.384723, -16.294363, -12.598233, -0.045924, -16.250696, -16.248014, -17.978128, -13.196740, -12.270724, -13.846956, -19.919687, -10.068569, -15.241811, -13.481664, -18.040934, -25.998392, -14.993484, -11.317522, -9.890749, -12.329998, -19.409908, -0.076228, -12.609658, -18.822079, -11.878047, -17.343204, -16.127514, -15.596684, -17.448807, -16.564968, -13.827169, -16.176964, -20.679138, -16.417645, -16.779739, -9.710198, -17.352810, -11.784765, -15.069656, -15.748496, -0.065264, -14.094069, -13.473398, -12.232275, -18.913937, -18.247463, -12.106804, -12.495767, -11.796571, -20.103813, -13.995477, -0.146744, -11.956972, -15.005518, -16.288380, -14.571086, -12.542833, -16.206045, -10.436768, -13.280074, -12.141393, -14.543300, -13.669678, -13.131637, -10.186003, -18.163006, -16.050739, -14.645392, -19.322050, -15.285501, -12.755323, -13.872435, -13.053715, -18.953682, -10.819674, -12.614906, -10.441852, -11.846161, -14.213023, -16.142311, -11.378542, -15.485106, -14.302790, -12.821352</min>
