<?xml version="1.0"?>
<net name="ICV-RMNet-PD-ReID-Light" version="6" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer name="data/norm/scale/Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="init_block1/dim_inc/conv" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>96</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="init_block1/dim_inc/fn" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/dim_red/conv" type="Convolution" precision="FP32" id="4">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="32" />
				<weights offset="3640" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/dim_red/fn" type="elu" precision="FP32" id="5">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/inner/dw1/conv" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4664" size="32" />
				<weights offset="4696" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/inner/dw1/fn" type="elu" precision="FP32" id="7">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/dim_inc/conv" type="Convolution" precision="FP32" id="8">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4984" size="128" />
				<weights offset="5112" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/add" type="Eltwise" precision="FP32" id="9">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/fn" type="elu" precision="FP32" id="10">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/dim_red/conv" type="Convolution" precision="FP32" id="11">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6136" size="32" />
				<weights offset="6168" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/dim_red/fn" type="elu" precision="FP32" id="12">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/inner/dw1/conv" type="Convolution" precision="FP32" id="13">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7192" size="32" />
				<weights offset="7224" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/inner/dw1/fn" type="elu" precision="FP32" id="14">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/dim_inc/conv" type="Convolution" precision="FP32" id="15">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7512" size="128" />
				<weights offset="7640" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/add" type="Eltwise" precision="FP32" id="16">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/fn" type="elu" precision="FP32" id="17">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/dim_red/conv" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8664" size="32" />
				<weights offset="8696" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/dim_red/fn" type="elu" precision="FP32" id="19">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/inner/dw1/conv" type="Convolution" precision="FP32" id="20">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9720" size="32" />
				<weights offset="9752" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/inner/dw1/fn" type="elu" precision="FP32" id="21">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/dim_inc/conv" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="10040" size="128" />
				<weights offset="10168" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/add" type="Eltwise" precision="FP32" id="23">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/fn" type="elu" precision="FP32" id="24">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/skip/pooling" type="Pooling" precision="FP32" id="25">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/skip/conv" type="Convolution" precision="FP32" id="26">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11192" size="256" />
				<weights offset="11448" size="8192" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/dim_red/conv" type="Convolution" precision="FP32" id="27">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
			<blobs>
				<biases offset="19640" size="64" />
				<weights offset="19704" size="2048" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/dim_red/fn" type="elu" precision="FP32" id="28">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/inner/dw1/conv" type="Convolution" precision="FP32" id="29">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>48</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="21752" size="64" />
				<weights offset="21816" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/inner/dw1/fn" type="elu" precision="FP32" id="30">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/dim_inc/conv" type="Convolution" precision="FP32" id="31">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22392" size="256" />
				<weights offset="22648" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/add" type="Eltwise" precision="FP32" id="32">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/fn" type="elu" precision="FP32" id="33">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/dim_red/conv" type="Convolution" precision="FP32" id="34">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="26744" size="64" />
				<weights offset="26808" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/dim_red/fn" type="elu" precision="FP32" id="35">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/inner/dw1/conv" type="Convolution" precision="FP32" id="36">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="30904" size="64" />
				<weights offset="30968" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/inner/dw1/fn" type="elu" precision="FP32" id="37">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/dim_inc/conv" type="Convolution" precision="FP32" id="38">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="31544" size="256" />
				<weights offset="31800" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/add" type="Eltwise" precision="FP32" id="39">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/fn" type="elu" precision="FP32" id="40">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/dim_red/conv" type="Convolution" precision="FP32" id="41">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="35896" size="64" />
				<weights offset="35960" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/dim_red/fn" type="elu" precision="FP32" id="42">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/inner/dw1/conv" type="Convolution" precision="FP32" id="43">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="40056" size="64" />
				<weights offset="40120" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/inner/dw1/fn" type="elu" precision="FP32" id="44">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/dim_inc/conv" type="Convolution" precision="FP32" id="45">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="40696" size="256" />
				<weights offset="40952" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/add" type="Eltwise" precision="FP32" id="46">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/fn" type="elu" precision="FP32" id="47">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/dim_red/conv" type="Convolution" precision="FP32" id="48">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="45048" size="64" />
				<weights offset="45112" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/dim_red/fn" type="elu" precision="FP32" id="49">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/inner/dw1/conv" type="Convolution" precision="FP32" id="50">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49208" size="64" />
				<weights offset="49272" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/inner/dw1/fn" type="elu" precision="FP32" id="51">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/dim_inc/conv" type="Convolution" precision="FP32" id="52">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="49848" size="256" />
				<weights offset="50104" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/add" type="Eltwise" precision="FP32" id="53">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/fn" type="elu" precision="FP32" id="54">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/skip/pooling" type="Pooling" precision="FP32" id="55">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/skip/conv" type="Convolution" precision="FP32" id="56">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="54200" size="512" />
				<weights offset="54712" size="32768" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/dim_red/conv" type="Convolution" precision="FP32" id="57">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
			<blobs>
				<biases offset="87480" size="128" />
				<weights offset="87608" size="8192" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/dim_red/fn" type="elu" precision="FP32" id="58">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/inner/dw1/conv" type="Convolution" precision="FP32" id="59">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>24</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="95800" size="128" />
				<weights offset="95928" size="1152" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/inner/dw1/fn" type="elu" precision="FP32" id="60">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/dim_inc/conv" type="Convolution" precision="FP32" id="61">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="97080" size="512" />
				<weights offset="97592" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/add" type="Eltwise" precision="FP32" id="62">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/fn" type="elu" precision="FP32" id="63">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_1/dim_red/conv" type="Convolution" precision="FP32" id="64">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="113976" size="128" />
				<weights offset="114104" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_1/dim_red/fn" type="elu" precision="FP32" id="65">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_1/inner/dw1/conv" type="Convolution" precision="FP32" id="66">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="130488" size="128" />
				<weights offset="130616" size="1152" />
			</blobs>
		</layer>
		<layer name="bottleneck3_1/inner/dw1/fn" type="elu" precision="FP32" id="67">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_1/dim_inc/conv" type="Convolution" precision="FP32" id="68">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="131768" size="512" />
				<weights offset="132280" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_1/add" type="Eltwise" precision="FP32" id="69">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_1/fn" type="elu" precision="FP32" id="70">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_2/dim_red/conv" type="Convolution" precision="FP32" id="71">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="148664" size="128" />
				<weights offset="148792" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_2/dim_red/fn" type="elu" precision="FP32" id="72">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_2/inner/dw1/conv" type="Convolution" precision="FP32" id="73">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="165176" size="128" />
				<weights offset="165304" size="1152" />
			</blobs>
		</layer>
		<layer name="bottleneck3_2/inner/dw1/fn" type="elu" precision="FP32" id="74">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_2/dim_inc/conv" type="Convolution" precision="FP32" id="75">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="166456" size="512" />
				<weights offset="166968" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_2/add" type="Eltwise" precision="FP32" id="76">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_2/fn" type="elu" precision="FP32" id="77">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_3/dim_red/conv" type="Convolution" precision="FP32" id="78">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="183352" size="128" />
				<weights offset="183480" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_3/dim_red/fn" type="elu" precision="FP32" id="79">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_3/inner/dw1/conv" type="Convolution" precision="FP32" id="80">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="199864" size="128" />
				<weights offset="199992" size="1152" />
			</blobs>
		</layer>
		<layer name="bottleneck3_3/inner/dw1/fn" type="elu" precision="FP32" id="81">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_3/dim_inc/conv" type="Convolution" precision="FP32" id="82">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="201144" size="512" />
				<weights offset="201656" size="16384" />
			</blobs>
		</layer>
		<layer name="bottleneck3_3/add" type="Eltwise" precision="FP32" id="83">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_3/fn" type="elu" precision="FP32" id="84">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_0/skip/pooling" type="Pooling" precision="FP32" id="85">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_0/skip/conv" type="Convolution" precision="FP32" id="86">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="218040" size="1024" />
				<weights offset="219064" size="131072" />
			</blobs>
		</layer>
		<layer name="bottleneck4_0/dim_red/conv" type="Convolution" precision="FP32" id="87">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="350136" size="256" />
				<weights offset="350392" size="32768" />
			</blobs>
		</layer>
		<layer name="bottleneck4_0/dim_red/fn" type="elu" precision="FP32" id="88">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_0/inner/dw1/conv" type="Convolution" precision="FP32" id="89">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="383160" size="256" />
				<weights offset="383416" size="2304" />
			</blobs>
		</layer>
		<layer name="bottleneck4_0/inner/dw1/fn" type="elu" precision="FP32" id="90">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_0/dim_inc/conv" type="Convolution" precision="FP32" id="91">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="385720" size="1024" />
				<weights offset="386744" size="65536" />
			</blobs>
		</layer>
		<layer name="bottleneck4_0/add" type="Eltwise" precision="FP32" id="92">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_0/fn" type="elu" precision="FP32" id="93">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_1/dim_red/conv" type="Convolution" precision="FP32" id="94">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="452280" size="256" />
				<weights offset="452536" size="65536" />
			</blobs>
		</layer>
		<layer name="bottleneck4_1/dim_red/fn" type="elu" precision="FP32" id="95">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_1/inner/dw1/conv" type="Convolution" precision="FP32" id="96">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="518072" size="256" />
				<weights offset="518328" size="2304" />
			</blobs>
		</layer>
		<layer name="bottleneck4_1/inner/dw1/fn" type="elu" precision="FP32" id="97">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_1/dim_inc/conv" type="Convolution" precision="FP32" id="98">
			<data dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="520632" size="1024" />
				<weights offset="521656" size="65536" />
			</blobs>
		</layer>
		<layer name="bottleneck4_1/add" type="Eltwise" precision="FP32" id="99">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_1/fn" type="elu" precision="FP32" id="100">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_2/dim_red/conv" type="Convolution" precision="FP32" id="101">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="587192" size="256" />
				<weights offset="587448" size="65536" />
			</blobs>
		</layer>
		<layer name="bottleneck4_2/dim_red/fn" type="elu" precision="FP32" id="102">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck4_2/inner/dw1/conv" type="Convolution" precision="FP32" id="103">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
