<?xml version="1.0"?>
<net name="ICV-RMNet-PD-ReID-Heavy" version="6" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_12493/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12" />
				<weights offset="12" size="12" />
			</blobs>
		</layer>
		<layer name="init_block1/dim_inc/conv" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128" />
				<weights offset="152" size="3456" />
			</blobs>
		</layer>
		<layer name="init_block1/dim_inc/fn" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/dim_red/conv" type="Convolution" precision="FP32" id="4">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="32" />
				<weights offset="3640" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/dim_red/fn" type="elu" precision="FP32" id="5">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/inner/dw1/conv" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4664" size="32" />
				<weights offset="4696" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/inner/dw1/fn" type="elu" precision="FP32" id="7">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/dim_inc/conv" type="Convolution" precision="FP32" id="8">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4984" size="128" />
				<weights offset="5112" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_1/add" type="Eltwise" precision="FP32" id="9">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_1/fn" type="elu" precision="FP32" id="10">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/dim_red/conv" type="Convolution" precision="FP32" id="11">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="6136" size="32" />
				<weights offset="6168" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/dim_red/fn" type="elu" precision="FP32" id="12">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/inner/dw1/conv" type="Convolution" precision="FP32" id="13">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7192" size="32" />
				<weights offset="7224" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/inner/dw1/fn" type="elu" precision="FP32" id="14">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/dim_inc/conv" type="Convolution" precision="FP32" id="15">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="7512" size="128" />
				<weights offset="7640" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_2/add" type="Eltwise" precision="FP32" id="16">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_2/fn" type="elu" precision="FP32" id="17">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/dim_red/conv" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="8664" size="32" />
				<weights offset="8696" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/dim_red/fn" type="elu" precision="FP32" id="19">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/inner/dw1/conv" type="Convolution" precision="FP32" id="20">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="9720" size="32" />
				<weights offset="9752" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/inner/dw1/fn" type="elu" precision="FP32" id="21">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/dim_inc/conv" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="10040" size="128" />
				<weights offset="10168" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_3/add" type="Eltwise" precision="FP32" id="23">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_3/fn" type="elu" precision="FP32" id="24">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_4/dim_red/conv" type="Convolution" precision="FP32" id="25">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="11192" size="32" />
				<weights offset="11224" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_4/dim_red/fn" type="elu" precision="FP32" id="26">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_4/inner/dw1/conv" type="Convolution" precision="FP32" id="27">
			<data dilations="1,1" group="8" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="12248" size="32" />
				<weights offset="12280" size="288" />
			</blobs>
		</layer>
		<layer name="bottleneck1_4/inner/dw1/fn" type="elu" precision="FP32" id="28">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_4/dim_inc/conv" type="Convolution" precision="FP32" id="29">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="12568" size="128" />
				<weights offset="12696" size="1024" />
			</blobs>
		</layer>
		<layer name="bottleneck1_4/add" type="Eltwise" precision="FP32" id="30">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck1_4/fn" type="elu" precision="FP32" id="31">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/skip/pooling" type="Pooling" precision="FP32" id="32">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/skip/conv" type="Convolution" precision="FP32" id="33">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="13720" size="256" />
				<weights offset="13976" size="8192" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/dim_red/conv" type="Convolution" precision="FP32" id="34">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<biases offset="22168" size="64" />
				<weights offset="22232" size="2048" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/dim_red/fn" type="elu" precision="FP32" id="35">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/inner/dw1/conv" type="Convolution" precision="FP32" id="36">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>192</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24280" size="64" />
				<weights offset="24344" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/inner/dw1/fn" type="elu" precision="FP32" id="37">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/dim_inc/conv" type="Convolution" precision="FP32" id="38">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24920" size="256" />
				<weights offset="25176" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_0/add" type="Eltwise" precision="FP32" id="39">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_0/fn" type="elu" precision="FP32" id="40">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/dim_red/conv" type="Convolution" precision="FP32" id="41">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="29272" size="64" />
				<weights offset="29336" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/dim_red/fn" type="elu" precision="FP32" id="42">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/inner/dw1/conv" type="Convolution" precision="FP32" id="43">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="33432" size="64" />
				<weights offset="33496" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/inner/dw1/fn" type="elu" precision="FP32" id="44">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/dim_inc/conv" type="Convolution" precision="FP32" id="45">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="34072" size="256" />
				<weights offset="34328" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_1/add" type="Eltwise" precision="FP32" id="46">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_1/fn" type="elu" precision="FP32" id="47">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/dim_red/conv" type="Convolution" precision="FP32" id="48">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="38424" size="64" />
				<weights offset="38488" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/dim_red/fn" type="elu" precision="FP32" id="49">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/inner/dw1/conv" type="Convolution" precision="FP32" id="50">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="42584" size="64" />
				<weights offset="42648" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/inner/dw1/fn" type="elu" precision="FP32" id="51">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/dim_inc/conv" type="Convolution" precision="FP32" id="52">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="43224" size="256" />
				<weights offset="43480" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_2/add" type="Eltwise" precision="FP32" id="53">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_2/fn" type="elu" precision="FP32" id="54">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/dim_red/conv" type="Convolution" precision="FP32" id="55">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="47576" size="64" />
				<weights offset="47640" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/dim_red/fn" type="elu" precision="FP32" id="56">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/inner/dw1/conv" type="Convolution" precision="FP32" id="57">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="51736" size="64" />
				<weights offset="51800" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/inner/dw1/fn" type="elu" precision="FP32" id="58">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/dim_inc/conv" type="Convolution" precision="FP32" id="59">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="52376" size="256" />
				<weights offset="52632" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_3/add" type="Eltwise" precision="FP32" id="60">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_3/fn" type="elu" precision="FP32" id="61">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_4/dim_red/conv" type="Convolution" precision="FP32" id="62">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="56728" size="64" />
				<weights offset="56792" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_4/dim_red/fn" type="elu" precision="FP32" id="63">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_4/inner/dw1/conv" type="Convolution" precision="FP32" id="64">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="60888" size="64" />
				<weights offset="60952" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_4/inner/dw1/fn" type="elu" precision="FP32" id="65">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_4/dim_inc/conv" type="Convolution" precision="FP32" id="66">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="61528" size="256" />
				<weights offset="61784" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_4/add" type="Eltwise" precision="FP32" id="67">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_4/fn" type="elu" precision="FP32" id="68">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_5/dim_red/conv" type="Convolution" precision="FP32" id="69">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="65880" size="64" />
				<weights offset="65944" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_5/dim_red/fn" type="elu" precision="FP32" id="70">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_5/inner/dw1/conv" type="Convolution" precision="FP32" id="71">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="70040" size="64" />
				<weights offset="70104" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_5/inner/dw1/fn" type="elu" precision="FP32" id="72">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_5/dim_inc/conv" type="Convolution" precision="FP32" id="73">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="70680" size="256" />
				<weights offset="70936" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_5/add" type="Eltwise" precision="FP32" id="74">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_5/fn" type="elu" precision="FP32" id="75">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_6/dim_red/conv" type="Convolution" precision="FP32" id="76">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="75032" size="64" />
				<weights offset="75096" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_6/dim_red/fn" type="elu" precision="FP32" id="77">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_6/inner/dw1/conv" type="Convolution" precision="FP32" id="78">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="79192" size="64" />
				<weights offset="79256" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_6/inner/dw1/fn" type="elu" precision="FP32" id="79">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_6/dim_inc/conv" type="Convolution" precision="FP32" id="80">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="79832" size="256" />
				<weights offset="80088" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_6/add" type="Eltwise" precision="FP32" id="81">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_6/fn" type="elu" precision="FP32" id="82">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_7/dim_red/conv" type="Convolution" precision="FP32" id="83">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="84184" size="64" />
				<weights offset="84248" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_7/dim_red/fn" type="elu" precision="FP32" id="84">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_7/inner/dw1/conv" type="Convolution" precision="FP32" id="85">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="88344" size="64" />
				<weights offset="88408" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_7/inner/dw1/fn" type="elu" precision="FP32" id="86">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_7/dim_inc/conv" type="Convolution" precision="FP32" id="87">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="88984" size="256" />
				<weights offset="89240" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_7/add" type="Eltwise" precision="FP32" id="88">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_7/fn" type="elu" precision="FP32" id="89">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_8/dim_red/conv" type="Convolution" precision="FP32" id="90">
			<data dilations="1,1" group="1" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="93336" size="64" />
				<weights offset="93400" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_8/dim_red/fn" type="elu" precision="FP32" id="91">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_8/inner/dw1/conv" type="Convolution" precision="FP32" id="92">
			<data dilations="1,1" group="16" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="97496" size="64" />
				<weights offset="97560" size="576" />
			</blobs>
		</layer>
		<layer name="bottleneck2_8/inner/dw1/fn" type="elu" precision="FP32" id="93">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_8/dim_inc/conv" type="Convolution" precision="FP32" id="94">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="98136" size="256" />
				<weights offset="98392" size="4096" />
			</blobs>
		</layer>
		<layer name="bottleneck2_8/add" type="Eltwise" precision="FP32" id="95">
			<data operation="sum" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck2_8/fn" type="elu" precision="FP32" id="96">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/skip/pooling" type="Pooling" precision="FP32" id="97">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/skip/conv" type="Convolution" precision="FP32" id="98">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="102488" size="512" />
				<weights offset="103000" size="32768" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/dim_red/conv" type="Convolution" precision="FP32" id="99">
			<data dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<biases offset="135768" size="128" />
				<weights offset="135896" size="8192" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/dim_red/fn" type="elu" precision="FP32" id="100">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/inner/dw1/conv" type="Convolution" precision="FP32" id="101">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<biases offset="144088" size="128" />
				<weights offset="144216" size="1152" />
			</blobs>
		</layer>
		<layer name="bottleneck3_0/inner/dw1/fn" type="elu" precision="FP32" id="102">
			<data alpha="1.0" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>48</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="bottleneck3_0/dim_inc/conv" type="Convolution" precision="FP32" id="103">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1" />
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
