<?xml version="1.0" ?>
<net batch="1" name="driver-action-recognition-adas-0002-decoder" version="6">
	<layers>
		<layer id="0" name="0" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="363/Output_0/Data_/copy_const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="16384"/>
			</blobs>
		</layer>
		<layer id="2" name="364" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="378/reshape/Dim4642_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="4" name="378/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="378" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="378/reshape/Dim46444646_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="7" name="378/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="384/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="9" name="385" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="316/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16424" size="524288"/>
			</blobs>
		</layer>
		<layer id="11" name="404" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="410/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="13" name="411" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="387/reshape/Dim4610_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="15" name="387/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="387" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="387/reshape/Dim46124614_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="18" name="387/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="393/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="20" name="394" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="317/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540724" size="524288"/>
			</blobs>
		</layer>
		<layer id="22" name="412" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="418/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="24" name="419" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="428" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="429" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="431/mul_" precision="FP16" type="Power">
			<data power="1" scale="0.04419417306780815" shift="0"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="442/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065012" size="8"/>
			</blobs>
		</layer>
		<layer id="29" name="443" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="444" precision="FP16" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="449/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065020" size="12"/>
			</blobs>
		</layer>
		<layer id="32" name="450" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="396/reshape/Dim4674_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="34" name="396/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="396" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="396/reshape/Dim46764678_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="37" name="396/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="402/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="39" name="403" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="318/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065032" size="524288"/>
			</blobs>
		</layer>
		<layer id="41" name="420" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="426/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="43" name="427" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="453" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="454" precision="FP16" type="Split">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="462" precision="FP16" type="Concat">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="465" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="466" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="467/reshape/Dim5454_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1589320" size="16"/>
			</blobs>
		</layer>
		<layer id="50" name="467/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="467" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1589336" size="1048576"/>
				<biases offset="2637912" size="2048"/>
			</blobs>
		</layer>
		<layer id="52" name="467/reshape/Dim54565458_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2639960" size="12"/>
			</blobs>
		</layer>
		<layer id="53" name="467/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="468" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="469/reshape/Dim5494_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2639972" size="16"/>
			</blobs>
		</layer>
		<layer id="56" name="469/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="469" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2639988" size="1048576"/>
				<biases offset="3688564" size="1024"/>
			</blobs>
		</layer>
		<layer id="58" name="469/reshape/Dim54965498_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3689588" size="12"/>
			</blobs>
		</layer>
		<layer id="59" name="469/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="470" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="473" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="487/reshape/Dim4594_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="63" name="487/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="487" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="487/reshape/Dim45964598_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="66" name="487/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="493/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="68" name="494" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="327/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3689600" size="524288"/>
			</blobs>
		</layer>
		<layer id="70" name="513" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="519/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="72" name="520" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="496/reshape/Dim4650_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="74" name="496/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="496" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="496/reshape/Dim46524654_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="77" name="496/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="502/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="79" name="503" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="328/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4213888" size="524288"/>
			</blobs>
		</layer>
		<layer id="81" name="521" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="527/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="83" name="528" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="537" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="538" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="540/mul_" precision="FP16" type="Power">
			<data power="1" scale="0.04419417306780815" shift="0"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="551/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065012" size="8"/>
			</blobs>
		</layer>
		<layer id="88" name="552" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="553" precision="FP16" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="558/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065020" size="12"/>
			</blobs>
		</layer>
		<layer id="91" name="559" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="505/reshape/Dim4602_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="93" name="505/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="505" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="505/reshape/Dim46044606_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="96" name="505/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="511/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="98" name="512" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="329/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="4738176" size="524288"/>
			</blobs>
		</layer>
		<layer id="100" name="529" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="535/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="102" name="536" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="562" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="563" precision="FP16" type="Split">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="571" precision="FP16" type="Concat">
			<data axis="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="6">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="7">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="574" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="575" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="576/reshape/Dim5478_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1589320" size="16"/>
			</blobs>
		</layer>
		<layer id="109" name="576/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="576" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="1024" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5262464" size="1048576"/>
				<biases offset="6311040" size="2048"/>
			</blobs>
		</layer>
		<layer id="111" name="576/reshape/Dim54805482_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2639960" size="12"/>
			</blobs>
		</layer>
		<layer id="112" name="576/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="577" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="578/reshape/Dim5502_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="2639972" size="16"/>
			</blobs>
		</layer>
		<layer id="115" name="578/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="578" precision="FP16" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6313088" size="1048576"/>
				<biases offset="7361664" size="1024"/>
			</blobs>
		</layer>
		<layer id="117" name="578/reshape/Dim55045506_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="3689588" size="12"/>
			</blobs>
		</layer>
		<layer id="118" name="578/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="579" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="582" precision="FP16" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="596/reshape/Dim4626_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="122" name="596/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="596" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="596/reshape/Dim46284630_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="125" name="596/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="602/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="127" name="603" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="338/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7362688" size="524288"/>
			</blobs>
		</layer>
		<layer id="129" name="622" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="628/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="131" name="629" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="605/reshape/Dim4634_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16384" size="16"/>
			</blobs>
		</layer>
		<layer id="133" name="605/reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="605" precision="FP16" type="Tile">
			<data axis="0" tiles="8"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="605/reshape/Dim46364638_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16400" size="12"/>
			</blobs>
		</layer>
		<layer id="136" name="605/reshape_back" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="611/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16412" size="12"/>
			</blobs>
		</layer>
		<layer id="138" name="612" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="339/Output_0/Data__const" precision="FP16" type="Const">
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<custom offset="7886976" size="524288"/>
			</blobs>
		</layer>
		<layer id="140" name="630" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>512</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="636/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="540712" size="12"/>
			</blobs>
		</layer>
		<layer id="142" name="637" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="646" precision="FP16" type="Permute">
			<data order="0,2,1"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="647" precision="FP16" type="GEMM">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>64</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="145" name="649/mul_" precision="FP16" type="Power">
			<data power="1" scale="0.04419417306780815" shift="0"/>
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="146" name="660/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065012" size="8"/>
			</blobs>
		</layer>
		<layer id="147" name="661" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="148" name="662" precision="FP16" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>128</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="667/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1065020" size="12"/>
			</blobs>
		</layer>
		<layer id="150" name="668" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>8</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="614/reshape/Dim4658_const" precision="I32" type="Const">
			<output>
